Repository: OpenDroneMap/docs
Catalog: source/locale/*/LC_MESSAGES/arguments.po
Languages: es, fil

source: Options and Flags
es: Opciones e indicadores
fil: Mga Opsyon at Tanda

source: Arguments
es: Argumentos
fil: Mga Argumento

source: Show help message and exit.
es: Mostrar mensaje de ayuda y salir.
fil: Ipakita ang help message at mag-exit.

source: Path to input images.
es: Ruta a las imágenes de entrada.
fil: Kawing patungo sa mga imahe.

source: Path to the project folder.
es: Ruta a la carpeta del proyecto.
fil: Kawing patungo sa mga proyekto.

source: Resizes images by the largest side for opensfm. Set to ``-1`` to disable.
es: Cambia el tamaño de las imágenes por el lado más grande para OpenSFM. Configure en ``-1`` para deshabilitar.
fil: Binabago ang laki ng imahe mula sa pinakamalaki na sukat para sa opensfm. I-set sa ``-1`` para ma-disable.

source: Default: ``2048``
es: Predeterminado: ``2048``

source: Options: ``dataset`` | ``split`` | ``merge`` | ``opensfm`` | ``mve`` | ``odm_filterpoints`` | ``odm_meshing`` | ``mvs_texturing`` | ``odm_georeferencing`` | ``odm_dem`` | ``odm_orthophoto``
es: Opciones: ``dataset`` | ``split`` | ``merge`` | ``opensfm`` | ``mve`` | ``odm_filterpoints`` | ``odm_meshing`` | ``mvs_texturing`` | ``odm_georeferencing`` | ``odm_dem`` | ``odm_orthophoto``
fil: Opsyon: ``dataset`` | ``split`` | ``merge`` | ``opensfm`` | ``mve`` | ``odm_filterpoints`` | ``odm_meshing`` | ``mvs_texturing`` | ``odm_georeferencing`` | ``odm_dem`` | ``odm_orthophoto``

source: Generates Entwine Point Cloud. Useful on its own, this flag is automatically added when running in WebODM and useful for creating the correct directory structure when running on NodeODM or command line for import into WebODM.
es: Genera una Nube de Puntos Entwine. Útil por sí solo, este indicador se agrega automáticamente cuando se ejecuta en WebODM y es útil para crear la estructura de directorio correcta cuando se ejecuta en NodeODM o en la línea de comandos para importar a WebODM.
fil: Generates Entwine Point Cloud. Ang flag na ito ay automatikong nadadagdag kapag sinimulan ang WebODM at magagamit kapag bumubuo ng tamang directory structure kapag nagpapatakbo ng NodeODM o sa pagimport ng command line para maging WebODM.

source: Force rerun of all tasks.
es: Forzar la repetición de todas las tareas.
fil: Pagulit sa lahat ng tasks.

source: Projection used to transform the model into geographic coordinates.
es: Proyección utilizada para transformar el modelo a coordenadas geográficas.
fil: Prodyeksyon na ginagamit sa pagtransform ng model sa mga heyograpikong coordinate.

source: Minimum number of features to extract per image. More features leads to better results but slower execution.
es: Número mínimo de características para extraer por imagen. Mas características llevan a mejores resultados pero una ejecución mas lenta.
fil: Pinakamababang bilang ng pwede i-extract na imahe. Mas maraming tampok ay magreresulta ng mas magandang resulta ngutin mas mabagal na pagsasakatuparan.

source: Default: ``8000``
es: Predeterminado: ``8000``

source: Set feature extraction quality. Higher quality generates better features, but requires more memory and takes longer.
es: Seleccionar la calidad de extracción de rasgos. Una calidad mas alta genera mejores rasgos, pero requiere mas memoria y toma mas tiempo.
fil: I-set ang feature extraction quality. Ang mas mataas na quality ay naggegenerate ng mas magandang features, ngunit ang mas kumakain ito ng mas malaking memorya at mas matagal ang proseso.

source: Options: ``ultra`` | ``high`` | ``medium`` | ``low`` | ``lowest``
es: Opciones: ``ultra`` | ``high`` | ``medium`` | ``low`` | ``lowest``
fil: Mga Opsiyon: ``ultra`` | ``high`` | ``medium`` | ``low`` | ``lowest``

source: Default: ``high``
es: Predeterminado: ``high``

source: Number of nearest images to pre-match based on GPS exif data. Set to ``0`` to skip pre-matching. Neighbors works together with Distance parameter, set both to 0 to not use pre-matching. OpenSFM uses both parameters at the same time, Bundler uses only one which has value, prefering the Neighbors parameter.
es: Número de imágenes cercanas a la comparación previa basado en los datos exif de GPS. Establezca en ``0`` para omitir la comparación previa. El parámetro Neighbors trabaja junto con el parámetro Distance, establezca ambos en 0 para no utilizar la comparación previa. OpenSFM usa ambos parámetros al mismo tiempo, Bundler usa solo uno que tiene valor, prefiriendo el parámetro Neighbors.
fil: Bilang ng pinakamalapit na imahe na i-prematch base sa GPS exif data. I-set sa ``0`` para malagpasan anf pre-matching. Ang Neighbors ay gumagana sa pamamagitan ng Distance parameter, i-set pareho sa 0 para hindi na gamitin ang pre-matching. Ang OpenSFM ay gumagamit ng parehong parameters ng sabay, Ang Bundler naman ay gumagamit lamang ng isa na may value, mas preferred nito ang Neighbors parameter.

source: Default: ``8``
es: Predeterminado: ``8``

source: Distance threshold in meters to find pre-matching images based on GPS exif data. Set both ``matcher-neighbors`` and this to ``0`` to skip pre-matching.
es: Umbral de distancia en metros, para encontrar imágenes pre-coincidentes basado en los datos exif de GPS. Establezca ambos ``matcher-neighbors`` y este en ``0`` para saltar la comparación previa.
fil: Ang distance threshold sa meters para hanapin ang pre-matching na imahe base sa GPS exif data. I-set pareho sa ``matcher-neighbors`` at ``0`` ito para malagpasan ang pre-matching.

source: Default: ``0``
es: Predeterminado: ``0``

source: Turn off camera parameter optimization during bundler. Off by default unless ``--camera`` parameter used.
es: Desactive la optimización de parámetros de cámara durante la agrupación. Desactivado de manera predeterminada, a menos que se utilice el parámetro ``--camera``.
fil: Patayin ang camera paremeter optimization habang ginagamit ang blunder. Off ang default maliban kung ``--camera`` parameter ang gamit.

source: Set a camera projection type. Manually setting a value can help improve geometric undistortion. By default the application tries to determine a lens type from the images metadata.
es: Configure un tipo de proyección de cámara. Establecer manualmente un valor puede ayudar a mejorar la distorsión geométrica. De forma predeterminada, la aplicación intenta determinar el tipo de lente a partir de los metadatos de las imágenes.
fil: i-set ang klase ng camera projection. Ang manual na pagaayos ng value ay makakatulong sa pagpapa-improve ng geometric undistortion. By default, ang aplikasyon ay sinusubukan na i-determine ang lens type galing sa image metadata.

source: Options: ``auto`` | ``perspective`` | ``brown`` | ``fisheye`` | ``spherical``
es: Opciones: ``auto`` | ``perspective`` | ``brown`` | ``fisheye`` | ``spherical``
fil: Mga Opsiyon: ``auto`` | ``perspective`` | ``brown`` | ``fisheye`` | ``spherical``

source: Default: ``auto``
es: Predeterminado: ``auto``

source: Set the radiometric calibration to perform on images. When processing multispectral images you should set this option to obtain reflectance values (otherwise you will get digital number (DN) values).
es: Configure la calibración radiométrica a realizar en las imágenes. Al procesar imágenes multiespectrales, debe configurar esta opción para obtener valores de reflectancia (de lo contrario, obtendrá valores numéricos digitales (DN)).
fil: Magset ng radiometric calibration na gagamitin sa mga imahe. kapag nagpaprocess ng multispectral images, kailangan na i-set ang opsiyon para maobtain ang reflectance values (kung hindi ay makukuha lamang ang digital number (DN) values).

source: [``camera``] applies black level, vignetting, row gradient gain/exposure compensation (if appropriate EXIF tags are found).
es: [``camera``] aplica nivel de negro, viñeteo, ganancia de gradiente de fila / compensación de exposición (si se encuentran las etiquetas EXIF apropiadas).
fil: [``camera``] ay nagaapply ng black level, vignetting, row gradient gain/exposure compensation (kung sapat na EXIF tags ang mayroon).

source: [``camera+sun``] is experimental, applies all the corrections of [``camera``] and additionally compensates for spectral radiance registered via a downwelling light sensor (DLS) taking in consideration the angle of the sun.
es: [``camera+sun``] es experimental, aplica todas las correcciones de la [``camera``] y además compensa la radiación espectral registrada a través de un sensor de luz descendente (DLS) teniendo en cuenta el ángulo del sol.
fil: Ang [``camera+sun``] ay experiemental, inaapply lahat ng correction ng [``camera``] at dinadagdagan ng spectral radiance na registered via a downdwelling light sensor (DLS) na pinagsasaalang-alang ang anggulo ng araw.

source: Options: ``none`` | ``camera`` | ``camera+sun``
es: Opciones: ``none`` | ``camera`` | ``camera+sun``
fil: Mga Opsiyon: ``none`` | ``camera`` | ``camera+sun``

source: Default: ``none``
es: Predeterminado: ``none``

source: The maximum number of processes to use in various processes. Peak memory requirement is ~1GB per thread and 2 megapixel image resolution.
es: El número máximo de procesos a utilizar en varios procesos. El requisito de memoria máxima es ~1 GB por hilo y una resolución de imagen de 2 megapíxeles.
fil: Ang pinakamalaking bilang ng proseso na gagamitin sa ibat-ibang proseso. Ang peak memory requirement ay ~1GB per thread at 2 megapixel na resolusyon ng imahe.

source: Default: *number of cores*
es: Predeterminado: *number of cores*

source: Controls the density of the point cloud by setting the resolution of the depthmap images. Higher values take longer to compute and more memory but produce denser point clouds.
es: Controla la densidad de la nube de puntos estableciendo la resolución de las imágenes del mapa de profundidad. Los valores más altos tardan más en calcularse y requieren más memoria, pero producen nubes de puntos más densas.
fil: Maaaring macontrol ang density ng point cloud sa pamamagitan ng pag-set ng resolusyon ng depthmap images. Ang mas mataas na value ay mas matagal macompute at mas malaking memorya ang mapo-produce ng denser point clouds.

source: Default: ``640``
es: Predeterminado: ``640``

source: Minimum number of views that should reconstruct a point for it to be valid. Use lower values if your images have less overlap. Lower values result in denser point clouds but with more noise. Only applies if using OpenSfM for dense matching.
es: Número mínimo de vistas que deben reconstruir un punto para que sea válido. Utilice valores más bajos si sus imágenes tienen menos traslape. Los valores más bajos dan como resultado nubes de puntos más densas pero con más ruido. Solo se aplica si se usa OpenSfM para coincidencias densas.
fil: Pinakakonti na bilang ng view na dapat magreconstruct sa point para ito ay maging valid. Gumamit ng mas mababang values kung ang imahe ay may mas konti na overlap. Ang mas mababang values ay nagreresulta ng mas dense na point clouds ngunit mas maraming noise. Ito ay nagaapply lamang kung ikaw ay gumagamit ng OpenSfM para sa dense matching.

source: Default: ``3``
es: Predeterminado: ``3``

source: Raw depthmap computation algorithm. ``PATCH_MATCH`` and ``PATCH_MATCH_SAMPLE`` are faster, but might miss some valid points. ``BRUTE_FORCE`` takes longer but produces denser reconstructions.
es: Algoritmo de cálculo de mapas de profundidad sin procesar. ``PATCH_MATCH`` y ``PATCH_MATCH_SAMPLE`` son más rápidos, pero pueden perder algunos puntos válidos. ``BRUTE_FORCE`` lleva más tiempo pero produce reconstrucciones más densas.
fil: Raw depthmap computation algorithm. ``PATCH_MATCH`` at ``PATCH_MATCH_SAMPLE`` ay mas mabilis, ngunit baka maka-miss ng valid points. Ang ``BRUTE_FORCE`` ay mas matagal ngunit nagreresulta ng desnser reconstructions.

source: Options: ``PATCH_MATCH`` | ``PATCH_MATCH_SAMPLE`` | ``BRUTE_FORCE``
es: Opciones: ``PATCH_MATCH`` | ``PATCH_MATCH_SAMPLE`` | ``BRUTE_FORCE``
fil: Mga Opsiyon: ``PATCH_MATCH`` | ``PATCH_MATCH_SAMPLE`` | ``BRUTE_FORCE``

source: Default: ``PATCH_MATCH``
es: Predeterminado: ``PATCH_MATCH``

source: When using ``PATCH_MATCH`` or ``PATCH_MATCH_SAMPLE``, controls the standard deviation threshold to include patches. Patches with lower standard deviation are ignored.
es: Cuando se usa ``PATCH_MATCH`` o ``PATCH_MATCH_SAMPLE``, se controla el umbral de la desviación estándar para incluir parches. Los parches con una desviación estándar mas baja se ignoran.
fil: Kapag gumagamit ng ``PATCH_MATCH`` o ``PATCH_MATCH_SAMPLE``, ang nagcocontrol ng standard deviation threshold para maisama ang mga patches. Ang mga patches na may mas mababang standard deviation ay ini-ignore.

source: Default: ``1``
es: Predeterminado: ``1``

source: Run local bundle adjustment for every image added to the reconstruction and a global adjustment every 100 images. Speeds up reconstruction for very large datasets.
es: Ejecute un ajuste de paquete local para cada imagen agregada a la reconstrucción y un ajuste global cada 100 imágenes. Acelera la reconstrucción de conjuntos de datos muy grandes.
fil: Mag-run ng local bundle adjustment kada imahe na dinadagdag sa reconstruction at global adjustment kada 100 na imahe. Pinapabilis nito ang reconstruction ng mga malalaking datasets.

source: Discard points that have less than a certain confidence threshold. This only affects dense reconstructions performed with MVE. Higher values discard more points.
es: Descarta puntos que tienen menos de un cierto nivel de confianza. Esto afecta solamente a las reconstrucciones densas hechas con MVE. Los valores mas altos descartan mas puntos.
fil: I-discard ang mga points na may hindi siguradong threshold. Makakaapekto lamang ito sa dense reconstruction ng MVE. Ang higher values ay pinapagsawalang bahala ang mga points.

source: Default: ``0.6``
es: Predeterminado: ``0.6``

source: Use a full 3D mesh to compute the orthophoto instead of a 2.5D mesh. This option is a bit faster and provides similar results in planar areas.
es: Utilice una malla 3D completa para calcular la ortofoto en vez de utilizar una mala 2.5D. Esta opción es un poco mas rápida y produce resultados similares en áreas planas.
fil: Gumamit ng full 3d mesh upang macompute ang orthophoto kesa sa 2.5D mesh. Ang opsyon na ito ay mas mabilis at nagbibigay ng resulta sa planar areas.

source: Skip generation of a full 3D model. This can save time if you only need 2D results such as orthophotos and DEMs.
es: Omitir la generación de un modelo 3D completo. Esto puede ahorrar tiempo si solamente necesita resultados 2D como ortofotos o DEMs.
fil: Lagpasan ang generation ng full 3d model. Makakatipid ka ng oras kung ang resulta na kailangan mo lang ay 2D tulad ng orthophotos at DEMs.

source: Use opensfm to compute dense point cloud alternatively.
es: Utilice openSFM para calcular la nube de puntos densa, de forma alternativa.
fil: Buksan ang opensfm para macompute ang dense point cloud alternatively.

source: Ignore Ground Sampling Distance (GSD). GSD caps the maximum resolution of image outputs and resizes images when necessary, resulting in faster processing and lower memory usage. Since GSD is an estimate, sometimes ignoring it can result in slightly better image output quality.
es: Ignore la distancia de muestreo del suelo (GSD). GSD limita la resolución máxima de las imágenes de salida y cambia el tamaño de las imágenes cuando es necesario, lo que resulta en un procesamiento más rápido y un menor uso de memoria. Dado que el GSD es una estimación, a veces ignorarlo puede resultar en una calidad de imagen de salida ligeramente mejor.
fil: Wag pansinin ang Ground Sampling Distance (GSD). Ang GSD ay nagcacap ng pinakamaraming bilang ng imahe at nagreresize ng imahe kung kinakailangan na nagreresulta ng mas mabilis na pagproseso at mas kaunti na memory usage. Bilang ang GSD ay estimate lamang, ang hindi pagbigay pansin dito ay magreresulta ng medyo mas mabuting quality ng imahe.

source: The maximum vertex count of the output mesh.
es: El conteo máximo de vértices de la malla de salida.
fil: Ang pinakamaraming bilang ng vertex ng output mesh.

source: Default: ``100000``
es: Predeterminado: ``100000``

source: Oct-tree depth used in the mesh reconstruction, increase to get more vertices, recommended values are 8-12.
es: La profundidad del Oct-tree utilizada en la reconstrucción de la malla, aumente para obtener más vértices, los valores recomendados son 8-12.

source: Default: ``9``
es: Predeterminado: ``9``

source: Number of points per octree node. For relatively low noise, values in the range of [1-5] can be used. For noisier datasets, large values in the range of [15-20] may be employed.
es: Número de puntos por nodo octree. Para un ruido relativamente bajo, se pueden usar valores en el rango de [1-5]. Para conjuntos de datos con mas ruido, se pueden usar valores mas grandes en el rango de [15-20].
fil: Bilang ng mga points kada octree node. Para sa mga low noise, ang value na nasa [1-5] ay magagamit. Para naman sa mas mataas na noise datasets, ang malaking value na nasa [15-20] naman ang magagamit.

source: Default: ``1.0``
es: Predeterminado: ``1.0``

source: This floating point value specifies the importance that interpolation of the point samples is given in the formulation of the screened Poisson equation. The results of the original (unscreened) Poisson Reconstruction can be obtained by setting this value to ``0``.
es: Este valor de punto flotante especifica la importancia que se le da a la interpolación de las muestras puntuales en la formulación de la ecuación de Poisson filtrada. Los resultados de la reconstrucción de Poisson original (no filtrada) se pueden obtener estableciendo este valor en ``0``.
fil: Tinutukoy ng floating point value ang kahalagahan na ang pag-interpolate ng mga muwestra ng mga punto ay ibinigay sa pagbabalangkas ng na-screen na Poisson equation. Ang mga resulta ng orihinal (unscreened) Poisson Reconstruction ay maaaring makuha sa pamamagitan ng pagtatakda ng halagang ito sa "0".

source: Default: ``4``
es: Predeterminado: ``4``

source: **Experimental.** Skips dense reconstruction and 3D model generation. It generates an orthophoto directly from the sparse reconstruction. If you just need an orthophoto and do not need a full 3D model, turn on this option.
es: ** Experimental.** Omite la reconstrucción densa y la generación del modelo 3D. Genera una ortofoto directamente a partir de la reconstrucción escasa. Si solo necesita una ortofoto y no necesita un modelo 3D completo, active esta opción.
fil: ** Eksperimental. ** Nilaktawan ang masinsin na pagyari at pagbuo ng modelong 3D. Bumubuo ito ng isang orthophoto nang direkta mula sa kalat-kalat na pagyari. Kung orthophoto lamang ang kailangan, at hindi isang buong 3D na modelo, i-on ang opsyong ito.

source: Automatically crop image outputs by creating a smooth buffer around the dataset boundaries, shrinked by N meters. Use ``0`` to disable cropping.
es: Recorte automáticamente los resultados de la imagen creando un búfer suave alrededor de los límites del conjunto de datos, reducido en N metros. Utilice ``0`` para deshabilitar el recorte.
fil: Awtomatikong i-crop ang mga imahe sa pamamagitan ng paglikha ng isang makinis na buffer sa paligid ng mga hangganan ng dataset, na lumiliit ng "N" na metro. Gamitin ang "0" para hindi paganahin ang pag-crop.

source: Classify the point cloud outputs using a Simple Morphological Filter. You can control the behavior of this option by tweaking the ``--dem-*`` parameters.
es: Clasifica las nubes de puntos de salida usando un filtro morfológico simple. Puede controlar el comportamiento de esta opción modificando los parametros ``--dem-*``.
fil: Uriin ang mga point cloud output gamit ang isang Simple Morphological Filter. Maaari mong kontrolin ang mga katangian ng opsyong ito sa pamamagitan ng pag-aayos ng mga parametrong ``--dem-*``.

source: Default: ``False``
es: Predeterminado: ``False``

source: Export the georeferenced point cloud in CSV format.
es: Exportar la nube de puntos georeferenciada en formato CSV.
fil: I-export ang georeferenced point cloud sa CSV format.

source: Export the georeferenced point cloud in LAS format.
es: Exportar la nube de puntos georeferenciada en formato LAS.
fil: I-export ang georeferenced point loud sa LAS format.

source: Filters the point cloud by removing points that deviate more than N standard deviations from the local mean. Set to ``0`` to disable filtering.
es: Filtra la nube de puntos eliminando puntos que se desvían mas de N desviaciones estándar del promedio local. Configure en ``0`` para deshabilitar el filtrado.
fil: Sinasala ang cloud point sa pamamagitan ng pag-alis ng mga puntos na lumihis nang higit sa N standard deviation mula sa local mean. Itakda sa "0" upang hindi paganahin ang pag-filter.

source: Default: ``2.5``
es: Predeterminado: ``2.5``

source: Simple Morphological Filter elevation scalar parameter.
es: Parámetro escalar de elevación del Filtro Morfológico Simple.

source: Default: ``1.25``
es: Predeterminado: ``1.25``

source: Simple Morphological Filter slope parameter (rise over run).
es: Parámetro de pendiente del filtro morfológico simple (altura sobre longitud).

source: Default: ``0.15``
es: Predeterminado: ``0.15``

source: Simple Morphological Filter elevation threshold parameter (meters).
es: Parámetro de umbral de elevación del Filtro Morfológico Simple (metros).

source: Default: ``0.5``
es: Predeterminado: ``0.5``

source: Simple Morphological Filter window radius parameter (meters).
es: Parámetro de radio de la ventana de Filtro Morfológico Simple (metros).

source: Default: ``18.0``
es: Predeterminado: ``18.0``

source: Options: ``area`` | ``gmi``
es: Opciones: ``area`` | ``gmi``
fil: Mga Opsiyon: ``area`` | ``gmi``

source: Default: ``gmi``
es: Predeterminado: ``gmi``

source: Affects orthophotos only. Higher values result in sharper corners, but can affect color distribution and blurriness. Use lower values for planar areas and higher values for urban areas. The default value works well for most scenarios.
es: Afecta solo a las ortofotos. Los valores más altos dan como resultado esquinas más nítidas, pero pueden afectar la distribución del color y el desenfoque. Utilice valores más bajos para áreas planas y valores más altos para áreas urbanas. El valor predeterminado funciona bien para la mayoría de los escenarios.
fil: Mga orthophoto lang ang naaapektohan. Ang mga mas mataas na halaga ay nagreresulta sa mas matalas na sulok, ngunit maaaring makaapekto sa pamamahagi ng kulay at pagkalabo. Gumamit ng mas mababang halaga para sa mga planar area at mas mataas na halaga para sa mga urban area. Ang default na halaga ay mabuti para sa karamihan ng mga sitwasyon.

source: Default: ``16``
es: Predeterminado: ``16``

source: Type of photometric outlier removal method.
es: Tipo de método de eliminación de valores atípicos fotométricos.
fil: Klase ng photometric outlier removal method.

source: Options: ``none`` | ``gauss_damping`` | ``gauss_clamping``
es: Opciones: ``none`` | ``gauss_damping`` | ``gauss_clamping``
fil: Mga Opsiyon: ``none`` | ``gauss_damping`` | ``gauss_clamping``

source: Default: ``gauss_clamping``
es: Predeterminado: ``gauss_clamping``

source: Skip geometric visibility test.
es: Omitir prueba de visibilidad geométrica.
fil: Lagpasan ang geometric visibility test.

source: Skip global seam leveling. Useful for IR data.
es: Omitir la nivelación global de costura. Útil para datos IR.
fil: Lagpasan ang global seam leveling. Magagamit ito sa IR data.

source: Skip local seam blending.
es: Omitir el mezclado de costuras locales.
fil: Lagpasan ang local seam blending.

source: Skip filling of holes in the mesh.
es: Omitir el llenado de huecos en la malla.
fil: Lagpasan ang pagpuno ng butas sa mga mesh.
