Repository: OpenDroneMap/docs
Catalog: source/locale/*/LC_MESSAGES/arguments.po
Languages: es, fil

source: Keep faces in the mesh that are not seen in any camera.
es: Mantener en la malla las caras que no se ven en ninguna cámara.
fil: Itago ang mga mukha sa mesh na hindi makikita sa camera.

source: Turn on gamma tone mapping or none for no tone mapping.
es: Active el mapeo de tonos gamma o ninguno para no mapear tonos.
fil: I-turn on ang gamma tone mapping o wag para sa no tone mapping.

source: Options: ``gamma`` | ``none``
es: Opciones: ``gamma`` | ``none``
fil: Mga Opsiyon: ``gamma`` | ``none``

source: Path to the file containing the ground control points used for georeferencing. The file needs to have the following line format: ``easting northing height pixelrow pixelcol imagename``
es: Ruta al archivo que contiene los puntos de control sobre el terreno utilizados para la georreferenciación. El archivo debe tener el siguiente formato de línea: ``easting northing height pixelrow pixelcol imagename``
fil: Ang path na naglalaman ng ground control points gamit sa georeferencing. Ang file ay kailangan ng mga sumusunod na line format: ``easting northing height pixelrow pixelcol imagename``

source: Default: None.
es: Predeterminado: None.

source: Use this tag if you have a gcp_list.txt but want to use the exif geotags instead.
es: Use esta etiqueta si tiene un gcp_list.txt pero desea usar las geoetiquetas exif en su lugar.
fil: Gamitin ang tag na ito kung mayroong gcp_list.txt ngunit gustong gumamit ng exit geotags.

source: Use this tag to build a DTM (Digital Terrain Model, ground only) using a simple morphological filter. Check the ``--dem*`` and ``--smrf*`` parameters for finer tuning.
es: Utilice esta etiqueta para construir un DTM (modelo digital de terreno, solo suelo) utilizando un filtro morfológico simple. Verifique los parámetros ``--dem*`` y ``--smrf*`` para un ajuste más fino.
fil: Gamitin ang tag na ito para bumuo ng DTM (Digital Terrain Model, ground only) gamit ang simpleng morphological filter. I-check ang ``--dem*`` at ``--smrf*`` na parameters para sa mas-finer na tuning.

source: Use this tag to build a DSM (Digital Surface Model, ground + objects) using a progressive morphological filter. Check the ``--dem*`` parameters for finer tuning.
es: Utilice esta etiqueta para construir un DSM (modelo de superficie digital, suelo + objetos) utilizando un filtro morfológico progresivo. Verifique los parámetros ``--dem*`` para un ajuste más fino.
fil: Gamitin ang tag na ito para bumuo ng DSM (Digital Surface Model, ground + objects) gamit ang PROGRESIBONG morphological filter. I-check ang ``--dem*`` na parameters para sa mas-finer na tuning.

source: Number of steps used to fill areas with gaps. Set to ``0`` to disable gap filling. Starting with a radius equal to the output resolution, N different DEMs are generated with progressively bigger radius using the inverse distance weighted (IDW) algorithm and merged together. Remaining gaps are then merged using nearest neighbor interpolation.
es: Número de pasos utilizados para rellenar áreas con huecos. Configure en ``0`` para deshabilitar el llenado de espacios. Comenzando con un radio igual a la resolución de salida, se generan N DEM diferentes con un radio progresivamente mayor utilizando el algoritmo de distancia inversa ponderada (IDW) y se fusionan. Luego, los espacios restantes se fusionan utilizando la interpolación del vecino más cercano.
fil: Bilang ng mga hakbang na ginamit upang punan ang mga lugar ng mga puwang. Itakda sa "0" upang hindi paganahin ang pagpuno ng puwang. Magsimula sa isang radius na katumbas ng resolusyon ng output, N ang bilang ng iba't ibang mga DEM na nabubuo, na may progresibong lumalaki na bilang ng radius gamit ang inverse distance weighted (IDW) na algorithm at pinagsama. Ang mga natitirang puwang ay pinagsasama gamit ang pinakamalapit na interpolation ng kapitbahay.

source: DSM/DTM resolution in cm / pixel.
es: Resolución del DSM/DTM en cm 7 pixel.
fil: Resolusyon ng DSM/DTM sa cm / pixel.

source: Default: ``5``
es: Predeterminado: ``5``

source: Decimate the points before generating the DEM. ``1`` is no decimation (full quality). ``100`` decimates ~99% of the points. Useful for speeding up generation.
es: Diezma los puntos antes de generar el DEM. ``1`` no diezma (calidad total). ``100`` diezma ~ 99% de los puntos. Útil para acelerar la generación.
fil: Tanggalin ang mga puntos bago bumuo ng DEM. Ang "1" ay walang pagkabulok (buong kalidad). Ang "100" naman ay ~ 99% na pagkabulok ng mga puntos. Kapaki-pakinabang para sa pagpapabilis ng henerasyon.

source: Computes an euclidean raster map for each DEM. The map reports the distance from each cell to the nearest NODATA value (before any hole filling takes place). This can be useful to isolate the areas that have been filled.
es: Calcula un mapa ráster euclidiano para cada DEM. El mapa informa la distancia desde cada celda al valor NODATA más cercano (antes de que se llene cualquier agujero). Esto puede resultar útil para aislar las áreas que se han llenado.
fil: Ang map ay nagrereport ng distansiya sa pagitan ng mga cell sa pinakamalapit na NODATA value (bago magkaron ng hole filling). Ito ay magagamit sa pag-isolate ng mga areas na na-fill na.

source: Orthophoto resolution in cm / pixel.
es: Resolución de la ortofoto en cm / pixel.
fil: Resolusyon ng orthopoto sa cm/pixel.

source: Set this parameter if you want a stripped geoTIFF.
es: Configure este parámetro si quiere un geoTIFF por franjas.
fil: I-set ang parameter na ito kung nais ng stripped geoTIFF.

source: Set the compression to use. Note that this could break gdal_translate if you don't know what you are doing.
es: Establezca la compresión que se utilizará. Tenga en cuenta que esto podría afectar gdal_translate si no sabe lo que está haciendo.
fil: I-set ang compression na gagamitin. Tandaan na maaari nitong ma-break ang gdal_translate kung hindi pamilyar sa iyong ginagawa.

source: Options: ``JPEG`` | ``LZW`` | ``PACKBITS`` | ``DEFLATE`` | ``LZMA`` | ``NONE``
es: Opciones: ``JPEG`` | ``LZW`` | ``PACKBITS`` | ``DEFLATE`` | ``LZMA`` | ``NONE``
fil: Mga Opsiyon: ``JPEG`` | ``LZW`` | ``PACKBITS`` | ``DEFLATE`` | ``LZMA`` | ``NONE``

source: Default: ``DEFLATE``
es: Predeterminado: ``DEFLATE``

source: Control whether the created orthophoto is a BigTIFF or classic TIFF. BigTIFF is a variant for files larger than 4GiB of data. See GDAL specs: https://www.gdal.org/frmt_gtiff.html for more info.
es: Controle si la ortofoto creada es un BigTIFF o un TIFF clásico. BigTIFF es una variante para archivos de más de 4GiB de datos. Consulte las especificaciones de GDAL: https://www.gdal.org/frmt_gtiff.html para obtener más información.
fil: I-control kung ang nagawa na orthophoto ay ang BigTIFF o ang classic TIFF. Ang BigTIFF ay para sa files na mas malaki sa 4GB and data. Tignan ang link para sa specs ng GDAL: https://www.gdal.org/frmt_gtiff.html for more info.

source: Options: ``YES`` | ``NO`` | ``IF_NEEDED`` | ``IF_SAFER``
es: Opciones: ``YES`` | ``NO`` | ``IF_NEEDED`` | ``IF_SAFER``
fil: Mga Opsiyon: ``YES`` | ``NO`` | ``IF_NEEDED`` | ``IF_SAFER``

source: Default: ``IF_SAFER``
es: Predeterminado: ``IF_SAFER``

source: Generates a polygon around the cropping area that cuts the orthophoto around the edges of features. This polygon can be useful for stitching seamless mosaics with multiple overlapping orthophotos.
es: Genera un polígono alrededor del área de recorte que corta la ortofoto alrededor de los bordes de las rasgos. Este polígono puede ser útil para unir mosaicos sin costura con varias ortofotos superpuestas.
fil: Nag-generate ng poligon sa palligid ng cropping area na nag-cut ng orthophoto sa paligid ng features. ANg poligon na ito ay makakatulong sa pagtatahi ng mossaics na may multiple overlapping orthophotos.

source: Build orthophoto overviews using gdaladdo.
es: Crea descripciones generales de ortofoto con gdaladdo.
fil: Gumawa ng orthophoto overviews gamit ang gdaladdo.

source: Print additional messages to the console.
es: Imprime mensajes adicionales en la consola.
fil: Magprint ng karagdagang mensahe sa console.

source: Generates a benchmark file with runtime info.
es: Genera un archivo de referencia con información del tiempo de ejecución.
fil: Mag-generate ng benchmark file sa runtime info.

source: Displays software version number and exits.
es: Muestra el número de versión del software y sale.
fil: Dinidisplay ang bersiyon ng software number at exits.

source: Average number of images per submodel. When splitting a large dataset into smaller submodels, images are grouped into clusters. This value regulates the number of images that each cluster should have on average.
es: Número medio de imágenes por submodelo. Al dividir un conjunto de datos grande en submodelos más pequeños, las imágenes se agrupan en grupos. Este valor regula la cantidad de imágenes que debe tener cada grupo en promedio.
fil: Ang average na bilang ng imahe kada submodel. kapag naghihiwalay ng malaking dataset sa mas maliit na submodels, ang mga imahe ay ginugrupo sa clusters. Ang value na ito ay nireregulate ang bilang ng imahe kung saan ang mga cluster ay dapat na may average.

source: Radius of the overlap between submodels. After grouping images into clusters, images that are closer than this radius to a cluster are added to the cluster. This is done to ensure that neighboring submodels overlap.
es: Radio de superposición entre submodelos. Después de agrupar imágenes en grupos, las imágenes que están más cerca de este radio de un grupo se agregan al grupo. Esto se hace para asegurar que los submodelos vecinos se superpongan.
fil: Radius ng overlap sa pagitan ng submodels. Matapos pagsamasamahin ang mga imahe sa isang cluster, ang mga imahe na mas malapit sa cluster ay nadaragdag agad sa cluster. Ito ay nangyayari para siguraduhin na ang magkakalapit na submodel ay magoverlap.

source: Delete heavy intermediate files (such as original orthos, dtm, dsm) to optimize disk space usage, while keeping the compressed versions. This affects the ability to restart the pipeline from an intermediate stage, but allows datasets to be processed on machines that don't have sufficient disk space available. Also, in this mode, the "reports" does not get written under the output 'opensfm' folder.
es: Elimine archivos intermedios pesados (como ortofotos originales, dtm, dsm) para optimizar el uso del espacio en disco, manteniendo las versiones comprimidas. Esto afecta la capacidad de reiniciar la canalización desde una etapa intermedia, pero permite que los conjuntos de datos se procesen en máquinas que no tienen suficiente espacio en disco disponible. Además, en este modo, los "informes" no se escriben en la carpeta de salida 'opensfm'.
fil: Magdelete ng mabibigat na intermediate files (katulad ng original orthos, dtm, dsm) para magamit ng husto ang disk space habang naitatabi ang mga compressed na bersyon. Nakakaapekto ito sa abilidad na magrestart ng ng pipeline mula sa intermediate stage, nagaallow ito ng datasets na magprocess sa machines na walng sapat na space na available. Also, sa mode na ito, ang mga "reports" ay hindi naisusulat sa output 'opensfm' folder.

source: URL to a ClusterODM instance for distributing a split-merge workflow on multiple nodes in parallel.
es: URL a una instancia de ClusterODM para distribuir un flujo de trabajo de split-merge en varios nodos en paralelo.

source: Default: *None*
es: Predeterminado: *None*

source: Choose what to merge in the merge step in a split dataset. By default all available outputs are merged.
es: Elije qué combinar en el paso de combinación de un conjunto de datos dividido. De forma predeterminada, se fusionan todas los archivos salidas disponibles.
fil: Piliin ang mga imemerge sa merge step ng split dataset. By default, lahat ng output ay minemerge nito.

source: Default: ``all``
es: Predeterminado: ``all``

source: `Help edit these docs! <https://github.com/OpenDroneMap/docs/blob/publish/source/arguments.rst>`_
es: `¡Ayuda a editar estos documentos! <https://github.com/OpenDroneMap/docs/blob/publish/source/arguments.rst>`_
