Repository: OpenDroneMap/docs
Catalog: source/locale/*/LC_MESSAGES/contributing.po
Languages: es, te

source: How To Contribute
es: Como contribuir
te: ఎలా సహకరించాలి

source: OpenDroneMap relies on community contributions. You can contribute in many ways, even if you are not a programmer.
es: OpenDroneMap depende de las contribuciones de la comunidad. Puedes contribuir de muchas formas, aunque no seas programador.
te: OpenDroneMap సంఘం రచనలపై ఆధారపడుతుంది. మీరు ప్రోగ్రామర్ కాకపోయినా మీరు అనేక విధాలుగా సహకరించవచ్చు.

source: Community Forum
es: Foro comunitario
te: కమ్యూనిటీ ఫోరం

source: If you are looking to get involved, are stuck on a problem, or want to reach out, `the forum <https://community.opendronemap.org/>`_ is a great place to start. You may find your questions already answered or else you can find other useful tips and resources. You can also contribute your open access datasets for others to explore. It is a good place go before submitting bug reports or getting in touch with developers before writing a new feature.
es: Si quieres involucrarte, tienes un porblema o quieres conectarte, `el foro <https://community.opendronemap.org/>`_ es un excelente lugar para comenzar. Es posible que que encuentres tus preguntas ya respondidas o puedes encontrar consejos utiles y recursos. Tambien puedes contribuir con tus conjuntos de datos de acceso abierto para que otros los puedan explorar. Es un buen lugar para revisar antes de enviar informes de errores oponerse ne contacto con los desarrolladores antes de escribir una nueva caracterisitca.
te: మీరు పాల్గొనడానికి చూస్తున్నట్లయితే, సమస్యలో చిక్కుకున్నా, లేదా చేరుకోవాలనుకుంటే, `ఫోరమ్ <https://community.opendronemap.org/>`_ ప్రారంభించడానికి గొప్ప ప్రదేశం. మీ ప్రశ్నలకు ఇప్పటికే సమాధానమివ్వవచ్చు లేదా మీరు ఇతర ఉపయోగకరమైన చిట్కాలు మరియు వనరులను కనుగొనవచ్చు. ఇతరులు అన్వేషించడానికి మీరు మీ ఓపెన్ యాక్సెస్ డేటాసెట్లను కూడా అందించవచ్చు. క్రొత్త ఫీచర్‌ను వ్రాయడానికి ముందు బగ్ నివేదికలను సమర్పించడానికి లేదా డెవలపర్‌లతో సన్నిహితంగా ఉండటానికి ముందు ఇది మంచి ప్రదేశం.

source: Reporting Bugs
es: Reportando Errores
te: దోషాలు నివేదించడం

source: Bugs are tracked as Github issues. Please create an issue in the repository and tag it with the Bug tag.
es: Errores son rastreados como problemas de Github. Por favor crea un porblema en el repositorio y etiquetalo con la etiqueta del error.
te: దోషాలు గితుబ్ సమస్యలుగా ట్రాక్ చేయబడతాయి. దయచేసి రిపోజిటరీలో సమస్యను సృష్టించి, బగ్ ట్యాగ్‌తో ట్యాగ్ చేయండి.

source: Explain the problem and include additional details to help maintainers reproduce the problem:
es: Explica el problema e incluye detalles adicionales para ayudar a los mantenedores a reproducir el problema:
te: సమస్యను వివరించండి మరియు సమస్యను పునరుత్పత్తి చేసేవారికి సహాయపడటానికి అదనపు వివరాలను చేర్చండి:

source: **Use a clear and descriptive title** for the issue to identify the problem.
es: **Usa un titulo claro y descriptivo** para identificar el problema.
te: **సమస్యను గుర్తించడానికి సమస్య కోసం స్పష్టమైన మరియు వివరణాత్మక శీర్షికను ఉపయోగించండి**.

source: **Describe the exact steps which reproduce the problem** in as many details as possible. For example, start by explaining how you run ODM (Docker, Vagrant, etc), e.g. which command exactly you used in the terminal. When listing steps, **don't just say what you did, but explain how you did it.**
es: **Describe los pasos exactos que reproducen el problema** lo mas detalladamente posible. Por ejemplo, comienza por explicar como corres ODM (Docker, Vagrant, etc), exactamente que comando usaste en el terminal. Al listar los pasos, **no solo digas que hiciste, explica como lo hiciste.**
te: **సమస్యను పునరుత్పత్తి చేసే ఖచ్చితమైన దశలను వివరించండి** సాధ్యమైనంత ఎక్కువ వివరాలలో. ఉదాహరణకు, మీరు ODM (డాకర్, వాగ్రెంట్, మొదలైనవి) ఎలా నడుపుతున్నారో వివరించడం ద్వారా ప్రారంభించండి, ఉదా. ఏ ఆదేశాన్ని మీరు టెర్మినల్‌లో ఉపయోగించారు. దశలను జాబితా చేసేటప్పుడు, **మీరు ఏమి చేశారో చెప్పకండి, కానీ మీరు దీన్ని ఎలా చేశారో వివరించండి.**

source: **Provide specific examples to demonstrate the steps.** Include links to files or GitHub projects, or copy/pasteable snippets, which you use in those examples. If you're providing snippets in the issue, use `Markdown code blocks <https://help.github.com/articles/markdown-basics/#multiple-lines>`_.
es: **Provee ejemplos especificos para demonstrar los pasos** Incluye links a archivos o proyectos de GitHub, o snippets que puedan ser copiados y pegados, que usaste en los ejemplos. Si vas a proveer snippets en el problema, usa `Markdown code blocks <https://help.github.com/articles/markdown-basics/#multiple-lines>`_.
te: **దశలను ప్రదర్శించడానికి నిర్దిష్ట ఉదాహరణలను అందించండి.** ఫైల్స్ లేదా గిట్‌హబ్ ప్రాజెక్ట్‌లకు లింక్‌లను చేర్చండి లేదా ఆ ఉదాహరణలలో మీరు ఉపయోగించే కాపీ / పేస్ట్ చేయగల స్నిప్పెట్‌లను చేర్చండి. మీరు ఇష్యూలో స్నిప్పెట్లను అందిస్తుంటే, `మార్క్‌డౌన్ కోడ్ బ్లాక్‌లను ఉపయోగించండి <https://help.github.com/articles/markdown-basics/#multiple-lines>`_.

source: **Describe the behavior you observed after following the steps** and point out what exactly is the problem with that behavior.
es: **Describe el comportamiento que observaste al seguir los pasos** y se√±ala cual es exactamente el problema en ese comportamiento.
te: **దశలను అనుసరించిన తర్వాత మీరు గమనించిన ప్రవర్తనను వివరించండి** మరియు ఆ ప్రవర్తనలో సమస్య ఏమిటో ఖచ్చితంగా సూచించండి.

source: **Explain which behavior you expected to see instead and why.**
es: **Explica que comportamiento esperabas observar y porque**
te: **బదులుగా మీరు చూడాలనుకున్న ప్రవర్తనను మరియు ఎందుకు వివరించండి.**

source: **Include screenshots and animated GIFs** which show you following the described steps and clearly demonstrate the problem. You can use `this tool to record GIFs on macOS and Windows <http://www.cockos.com/licecap/>`_, and `this tool <https://github.com/colinkeenan/silentcast>`_ or `this one <https://github.com/GNOME/byzanz>`_ on Linux.
es: **Incluye capturas de pantalla y GIF animados** que muestren como seguiste los pasos descritos y demuestren claramente el problema. Puedes usar `esta herramienta para grabar GIFs en macOS y Windows <http://www.cockos.com/licecap/>`_, y `esta herramienta <https://github.com/colinkeenan/silentcast>`_ o `esta <https://github.com/GNOME/byzanz>`_ en Linux.
te: **స్క్రీన్‌షాట్‌లు మరియు యానిమేటెడ్ GIF లను చేర్చండి** ఇది వివరించిన దశలను అనుసరిస్తుందని మీకు చూపిస్తుంది మరియు సమస్యను స్పష్టంగా ప్రదర్శిస్తుంది. మాకోస్ మరియు విండోస్‌లో GIF లను రికార్డ్ చేయడానికి మీరు `ఈ సాధనాన్ని ఉపయోగించవచ్చు <http://www.cockos.com/licecap/>`_, మరియు `ఈ సాధనం <https://github.com/colinkeenan/silentcast>`_ లేదా Linux లో `ఇది ఒకటి <https://github.com/GNOME/byzanz>`_

source: **If the problem is related to performance,** please post your machine's specs (host and guest machine).
es: **Si el problema es relacionado a rendimiento,** por favor postea las especificaciones de tu maquina (maquina host y guest).
te: **సమస్య పనితీరుకు సంబంధించినది అయితే,** దయచేసి మీ మెషీన్ స్పెక్స్ (హోస్ట్ మరియు గెస్ట్ మెషిన్) ను పోస్ట్ చేయండి.

source: **If the problem wasn't triggered by a specific action,** describe what you were doing before the problem happened and share more information using the guidelines below.
es: **Si el problema no fue desencadenado por una accion especifica,** describe lo que estabas haciendo antes de que el problema pasara y comparte mas informacion usando las pautas de abajo.
te: **నిర్దిష్ట చర్య ద్వారా సమస్య ప్రేరేపించబడకపోతే,** సమస్య జరగడానికి ముందు మీరు ఏమి చేస్తున్నారో వివరించండి మరియు దిగువ మార్గదర్శకాలను ఉపయోగించి మరింత సమాచారాన్ని పంచుకోండి.

source: Include details about your configuration and environment:
es: Incluye detalles de tu configuracion y ambiente:
te: మీ కాన్ఫిగరేషన్ మరియు ఎన్విరాన్మెంట్ గురించి వివరాలను చేర్చండి:

source: **Which version of ODM are you using?** A stable release? a clone of master?
es: **Que version de ODM estas usando?** Un lanzamiento estable? un clon de un master?
te: **మీరు ODM యొక్క ఏ వెర్షన్ ఉపయోగిస్తున్నారు?** స్థిరమైన విడుదల? మాస్టర్ యొక్క క్లోన్?

source: **What's the name and version of the OS you're using?**
es: **Cual es el nombre y la version del sistema operativo que estas usando?**
te: **మీరు ఉపయోగిస్తున్న OS యొక్క పేరు మరియు వెర్షన్ ఏమిటి?**

source: **Are you running ODM in a virtual machine or Docker?** If so, which VM software are you using and which operating systems and versions are used for the host and the guest?
es: **Estas usando ODM en una maquina virtual o Docker?** Si es asi, que software de maquina virtualestas usando y que sistema operativo y versiones estas usando para el host y el guest?
te: **మీరు ODM ను వర్చువల్ మెషీన్ లేదా డాకర్‌లో నడుపుతున్నారా?** అలా అయితే, మీరు ఏ VM సాఫ్ట్‌వేర్‌ను ఉపయోగిస్తున్నారు మరియు హోస్ట్ మరియు అతిథి కోసం ఏ ఆపరేటింగ్ సిస్టమ్స్ మరియు వెర్షన్లు ఉపయోగించబడుతున్నాయి?

source: Template For Submitting Bug Reports
es: Plantilla Para Enviar Informes de Errores
te: బగ్ నివేదికలను సమర్పించడానికి మూస

source: Pull Requests
es: Solicitudes de Extraxion
te: అభ్యర్థనలను లాగండి

source: Include screenshots and animated GIFs in your pull request whenever possible.
es: Incluye capturas de pantalla y GIFs animados en tus solicitudes de extraccion siempre que sea posible.
te: స్క్రీన్షాట్లు మరియు యానిమేటెడ్ GIF లను మీ పుల్ అభ్యర్థనలో సాధ్యమైనప్పుడల్లా చేర్చండి.

source: Follow the PEP8 Python Style Guide.
es: Sigue la guia de estilo de PEP8 Python.
te: PEP8 పైథాన్ స్టైల్ గైడ్‌ను అనుసరించండి.

source: End files with a newline.
es: Finaliza archivos con una nueva linea.
te: క్రొత్త లైన్‌తో ఫైల్‌లను ముగించండి.

source: Avoid platform-dependent code:
es: Evita codigo dependiente de la plataforma.
te: ప్లాట్‌ఫాం-ఆధారిత కోడ్‌ను నివారించండి:

source: Use require('fs-plus').getHomeDirectory() to get the home directory.
es: Usa require('fs-plus').getHomeDirectory() para ir al directorio de inicio.
te: హోమ్ డైరెక్టరీని పొందడానికి అవసరం ('fs-plus'). GetHomeDirectory () ఉపయోగించండి.

source: Use path.join() to concatenate filenames.
es: Usa pth.join() para concatenar nombres de archivos.
te: ఫైల్ పేర్లను సంగ్రహించడానికి path.join () ని ఉపయోగించండి.

source: Use os.tmpdir() rather than /tmp when you need to reference the temporary directory.
es: Usa os.tmpdir() en lugar de /tmp cuando necesites referenciar al directorio temporal.
te: మీరు తాత్కాలిక డైరెక్టరీని సూచించాల్సిన అవసరం వచ్చినప్పుడు / tmp కాకుండా os.tmpdir () ను ఉపయోగించండి.

source: Using a plain return when returning explicitly at the end of a function.
es: Usando un retorno plano cuando retorna al final de una funcion.
te: ఫంక్షన్ చివరిలో స్పష్టంగా తిరిగి వచ్చేటప్పుడు ప్లైన్ రిటర్న్ ఉపయోగించడం.

source: Not return null, return undefined, null, or undefined
es: No reotrnar null, retornar indefinido, null o undefinido
te: శూన్యంగా తిరిగి రాకూడదు, నిర్వచించబడని, శూన్యమైన లేదా నిర్వచించబడనిది
