Repository: OpenDroneMap/docs
Catalog: source/locale/*/LC_MESSAGES/gcp.po
Languages: es

source: Ground Control Points
es: Puntos de Control Terrestre

source: Ground control points are useful for correcting distortions in the data and referencing the data to know coordinate systems.
es: Los puntos de control terrestre son útiles para corregir distorsiones en los datos y referenciarlos en sistemas de coordenadas conocidos.

source: A Ground Control Point (GCP) is a position measurement made on the ground, typically using a high precision GPS. (Toffanin 2019)
es: Un Punto de Control Terrestre (GCP por sus siglas en inglés) es una medición de la posición hecha sobre el terreno, típicamente usando un GPS de alta precisión (Toffanin 2019).

source: Ground control points can be set existing structures like pavement corners, lines on a parking lot or contrasting color floor tiles, otherwise can be set using targets placed on the ground.
es: Los puntos de control terrestres se pueden colocar en estructuras existentes como esquinas de pavimento, líneas en un estacionamiento o baldosas de colores contrastantes; de otra manera, se pueden configurar utilizando objetivos colocados en el suelo.

source: Targets can be purchased or build with an ample variety of materials ranging from bucket lids to floor tiles.
es: Estos objetivos pueden comprarse o construirse con una amplia variedad de materiales que van desde tapas de cubetas hasta baldosas.

source: Recommended practices for GCP setting
es: Prácticas recomendadas para la colocación de GCP

source: Keep ground control points visible for all camera locations. Consider the expected ground sampling distance, illumination, vegetation, buildings and all the existing obstacles.
es: Mantén los puntos de control terrestre visibles para todas las ubicaciones de las cámaras. Considere la distancia de muestreo del terreno esperada, la iluminación, vegetación, edificios y todos los obstáculos existentes.

source: Procure an evenly horizontal distribution of the GCPs within the project, covering high and low elevations. A minimum of 5 GCP works for most of the jobs, and for larger projects 8 – 10 are sufficient. Locate some points near the corners and others in the center, considering that GCP spacing should be larger than the image footprint so that you can’t see more than one GCP in a single image.
es: Procura una distribución horizontal uniforme de los GCP dentro del proyecto, cubriendo elevaciones altas y bajas. Un mínimo de 5 GCP funciona para la mayoría de los trabajos y para proyectos más grandes, de 8 a 10 son suficientes. Ubique algunos puntos cerca de las esquinas y otros en el centro, considerando que el espaciado de los GCP debe ser mayor que la huella de la imagen para que no pueda ver más de un GCP en una sola imagen.

source: In order to ensure each GCP are found in at least 5 images, separate the points 10 to 30 meters from the perimeter of the project. This distance is dependent of the overlapping, so increasing overlapping should reduce the required distance from the perimeter.
es: Para asegurar que cada GCP se encuentre en al menos 5 imágenes, separa los puntos de 10 a 30 metros del perímetro del proyecto. Esta distancia depende del traslape, por lo que aumentar el traslape debería reducir la distancia requerida desde el perímetro.

source: GCP file format
es: Formato del archivo GCP

source: The format of the GCP file is simple.
es: El formato del archivo GCP es simple.

source: The first line should contain the name of the projection used for the geo coordinates. This can be specified either as a PROJ string (e.g. ``+proj=utm +zone=10 +ellps=WGS84 +datum=WGS84 +units=m +no_defs``), EPSG code (e.g. ``EPSG:4326``) or as a ``WGS84 UTM <zone>[N|S]`` value (eg. ``WGS84 UTM 16N``)
es: La primera línea debe contener el nombre de la proyección usada para las coordenadas geográficas. Esto puede ser especificado con una cadena PROJ (e.g. ``+proj=utm +zone=10 +ellps=WGS84 +datum=WGS84 +units=m +no_defs``), un código EPSG (e.g. ``EPSG:4326``) o como un valor ``WGS84 UTM 1[N|S]`` (eg. ``WGS84 UTM 16N``)

source: Subsequent lines are the X, Y & Z coordinates, your associated pixels, the image filename and optional extra fields, separated by tabs or spaces:
es: Las líneas siguientes son las coordinadas X, Y y Z, los pixeles asociados, el nombre del archivo de imagen y campos extras opcionales, separados por tabulaciones o espacios:

source: Elevation values can be set to "NaN" to indicate no value
es: Los valores de elevación pueden ser establecidos como "NaN" para indicar que no se tiene el dato.

source: The 7th column (optional) typically contains the label of the GCP.
es: La 7a columna (opcional) típicamente contiene la etiqueta del GCP.

source: GCP file format::
es: Formato del archivo GCP::

source: Example::
es: Ejemplo::

source: If you supply a GCP file called ``gcp_list.txt`` then ODM will automatically detect it. If it has another name you can specify using ``--gcp <path>``. If you have a gcp file and want to do georeferencing with exif instead, then you can specify ``--use-exif``. If you have high precision GPS measurements in your images (RTK) and want to use that information along with a gcp file, you can specify ``--force-gps``.
es: Si suministras un archivo GCP llamado ``gcp_list.txt`` ODM lo detectara automáticamente. Si el archivo tiene otro nombre, puedes especificar usando ``--gcp 1``. Si tienes un archivo gcp y quieres georreferenciar con exif, puedes especificarlo usando ``--use-exif``. Si tienes medidas GPS de alta precisión en tus imágenes (RTK) y quieres usar esa información junto a tu archivo gcp, puedes especificarlo usando ``--force-gps``.

source: `This post has some information about placing Ground Control Targets before a flight <http://diydrones.com/profiles/blogs/ground-control-points-gcps-for-aerial-photography>`_, but if you already have images, you can find your own points in the images post facto. It's important that you find high-contrast objects that are found in **at least** 3 photos, and that you find a minimum of 5 objects.
es: Este post tiene información sobre posicionar objetivos de control terrestre previo a un vuelo. `This post has some information about placing Ground Control Targets before a flight <http://diydrones.com/profiles/blogs/ground-control-points-gcps-for-aerial-photography>`_, pero si ya tienes imágenes, puedes encontrar tus propios puntos en las imagenes despues. Es importante que encuentres objetos de alto contraste que se encuentren en **al menos** 3 fotos, y que encuentres un mínimo de 5 objetos.

source: Sharp corners are good picks for GCPs. You should also place/find the GCPs evenly around your survey area.
es: Las esquinas definidas son buenas elecciones para GCPs. También debes colocar los GCP de manera uniforme alrededor del área de la medición.

source: The ``gcp_list.txt`` file must be created in the base of your project folder.
es: El archivo ``gcp_list.txt`` debe ser creado en la carpeta base de tu proyecto.

source: For good results your file should have a minimum of 15 lines after the header (5 points with 3 images to each point).
es: Para buenos resultados, tu archivo debe tener un mínimo de 15 líneas después del encabezado (5 puntos con 3 imágenes para cada punto).

source: User Interfaces
es: Interfaces de Usuario

source: You can use one of two user interfaces for creating GCP files:
es: Puedes usar una de las dos interfaces de usuario para crear archivos de GCP:

source: The POSM GCPi is loaded by default on WebODM. An example is available at `the WebODM Demo <http://demo.webodm.org/plugins/posm-gcpi/>`_. To use this with known ground control XYZ values, one would do the following:
es: POSM GCPi esta cargado automaticamente en WebODM. Un ejemplo esta disponible en `the WebODM Demo <http://demo.webodm.org/plugins/posm-gcpi/>`_. Para usarlo con valores XYZ de control terrestre conocidos, se haría lo siguiente:

source: Create a GCP list that only includes gcp name (this is the label that will be seen in the GCP interface), x, y, and z, with a header with a proj4 string of your GCPs (make sure they are in a planar coordinate system, such as UTM. It should look something like this:
es: Crear una lista GCP, que solo incluya el nombre gcp (esta es la etiqueta que se verá en la interfaz GCP), x, y, y z, con un título con una cadena de caracteres proj4 de sus GCPs (asegurese de que están es un sistema de coordenadas plano, como UTM. Debería verse algo así:

source: Then one can load this GCP list into the interface, load the images, and place each of the GCPs in the image.
es: Después se puede cargar la lista GCP en la interfaz, cargar las imágenes y colocar cada uno de los GCPs en la imagen.

source: This app needs to be installed separately or can be loaded as a WebODM plugin from `https://github.com/uav4geo/GCPEditorPro <https://github.com/uav4geo/GCPEditorPro>`_
es: Esta aplicación necesita ser instalada separadamente o puede ser cargada como un plugin WebODM desde `https://github.com/uav4geo/GCPEditorPro <https://github.com/uav4geo/GCPEditorPro>`_

source: Create a CSV file that includes the gcp name, northing, easting and elevation.
es: Crear un archivo csv que incluya el nombre gcp, el norte, el este y la elevación.

source: Then import the CSV from the main screen and type ``+proj=utm +zone=37 +south +ellps=WGS84 +datum=WGS84 +units=m +no_defs`` in the ``EPSG/PROJ`` box.
es: Luego importar el archivo CSV desde la pantalla principal y escribir ``+proj=utm +zone=37 +south +ellps=WGS84 +datum=WGS84 +units=m +no_defs`` en el cuadro ``EPSG/PROJ`` .

source: The following screen will display a map from where to select the GCPs to tag and import the respective images.
es: La siguiente pantalla va a mostrar un mapa desde donde se puede seleccionar los GCPs a etiquetar e importar las respectivas imágenes.

source: References
es: Referencias
