Repository: OpenDroneMap/docs
Catalog: source/locale/*/LC_MESSAGES/geo.po
Languages: te

source: Image Geolocation Files
te: చిత్రం జియోలొకేషన్ ఫైల్స్

source: By default ODM will use the GPS information embedded in the images, if it is available. Sometimes images do not contain GPS information, or a user wishes to override the information with more accurate data (such as RTK).
te: డిఫాల్ట్‌గా ODM అందుబాటులో ఉంటే చిత్రాలలో పొందుపరిచిన GPS సమాచారాన్ని ఉపయోగిస్తుంది. కొన్నిసార్లు చిత్రాలలో GPS సమాచారం ఉండదు, లేదా వినియోగదారు మరింత ఖచ్చితమైన డేటాతో (RTK వంటివి) సమాచారాన్ని ఓవర్‌రైడ్ చేయాలని కోరుకుంటారు.

source: Starting from ODM ``2.0`` people can supply an image geolocation file (geo) for this purpose.
te: ODM `` 2.0`` నుండి ప్రారంభించి ప్రజలు ఈ ప్రయోజనం కోసం ఇమేజ్ జియోలొకేషన్ ఫైల్ (జియో) ను సరఫరా చేయవచ్చు.

source: The format of the image geolocation file is simple.
te: ఇమేజ్ జియోలొకేషన్ ఫైల్ యొక్క ఫార్మాట్ సులభం.

source: The first line should contain the name of the projection used for the geo coordinates. This can be specified either as a PROJ string (e.g. ``+proj=utm +zone=10 +ellps=WGS84 +datum=WGS84 +units=m +no_defs``), EPSG code (e.g. ``EPSG:4326``) or as a ``WGS84 UTM <zone>[N|S]`` value (eg. ``WGS84 UTM 16N``)
te: మొదటి పంక్తిలో జియో కోఆర్డినేట్‌లకు ఉపయోగించే ప్రొజెక్షన్ పేరు ఉండాలి. దీనిని PROJ స్ట్రింగ్‌గా పేర్కొనవచ్చు (ఉదా. `` ప్రోజ్ = యుటిఎమ్ జోన్ = 10 ఎల్ప్స్ = డబ్ల్యుజిఎస్ 84 డాటమ్ = డబ్ల్యుజిఎస్ 84 యూనిట్లు = ఎమ్ నో_డెఫ్స్``), ఇపిఎస్‌జి కోడ్ (ఉదా. `PSEPSG: 4326``) లేదా` ` WGS84 UTM 1 [N | S] `` విలువ (ఉదా. `` WGS84 UTM 16N``)

source: Subsequent lines are the image filename, X, Y & Z (optional) coordinates, the camera angles (optional, currently used only for radiometric calibration) and the horizontal/vertical accuracy (optional):
te: తదుపరి పంక్తులు ఇమేజ్ ఫైల్ పేరు, X, Y, Z (ఐచ్ఛిక) అక్షాంశాలు, కెమెరా కోణాలు (ఐచ్ఛికం, ప్రస్తుతం రేడియోమెట్రిక్ క్రమాంకనం కోసం మాత్రమే ఉపయోగించబడతాయి) మరియు క్షితిజ సమాంతర / నిలువు ఖచ్చితత్వం (ఐచ్ఛికం):

source: Camera angles can be set to ``0`` if they are not available.
te: కెమెరా కోణాలు అందుబాటులో లేకపోతే `` 0`` కు సెట్ చేయవచ్చు.

source: The 10th column (optional) can contain extra fields, such as a label.
te: 10 వ కాలమ్ (ఐచ్ఛికం) లేబుల్ వంటి అదనపు ఫీల్డ్‌లను కలిగి ఉంటుంది.

source: File format::
te: ఫైల్ ఫార్మాట్::

source: Example::
te: ఉదాహరణ::

source: If you supply a file called ``geo.txt`` then ODM will automatically detect it. If it has another name you can specify using ``--geo <path>``.
te: మీరు `` ge.txt`` అనే ఫైల్‌ను సరఫరా చేస్తే, ODM స్వయంచాలకంగా దాన్ని కనుగొంటుంది. దీనికి మరొక పేరు ఉంటే మీరు `` --geo 1`` ని ఉపయోగించి పేర్కొనవచ్చు.

source: The ``geo.txt`` file must be created in the base of your project folder.
te: `` జియో.టెక్స్ట్`` ఫైల్ మీ ప్రాజెక్ట్ ఫోల్డర్ యొక్క బేస్ లో తప్పక సృష్టించబడాలి.
