Repository: OpenDroneMap/docs
Catalog: source/locale/*/LC_MESSAGES/installation.po
Languages: fil

source: Installation and Getting Started
fil: Instalasyon at Paano Simulan

source: This section is excerpted and modified with permission from `OpenDroneMap: The Missing Guide <https://odmbook.com>`_, by Piero Toffanin.
fil: Ang seksiyon na ito ay binago ng bahagya ng may permisyon galing sa `OpenDroneMap: The Missing Guide <https://odmbook.com>`_, na gawa ni Piero Toffanin.

source: Until recently OpenDroneMap was the term used to refer to a single command line application (what is now known as the ODM project). With the recent development of a web interface, an API and other tools, OpenDroneMap has become an ecosystem of various applications to process, analyze and display aerial data. This ecosystem is made of several components:
fil: Ang OpenDroneMap ay isang salita na ginagamit patukoy sa isang single command line na programa (na kilala rin bilang ODM na proyekto). Sa kamakailan lamang na progreso ng web interface, ang API ay ibang tools, pati na rin ang OpenDroneMap ang naging pinagmulan ng iba't-ibang programa upang ma-proseso, ma-suri at makita ang aerial data. ang ekosistem na ito ay ginawa para sa iilang component:

source: **ODM** is the processing engine, which can be used from the command line. It takes images as input and produces a variety of outputs, including point clouds, 3D models and orthophotos
fil: Ang **ODM** ay ang processing engine, na pwedeng gamitin sa command line. Tinatanggap nito ang mga imahe bilang input at nagpo-produce ng iba't-ibang outputs katulad ng point clouds, 3D models at orthophotos.

source: **NodeODM** is a light-weight API built on top of ODM. It allows users and applications to access the functions of ODM over a computer network
fil: Ang **NodeODM** ay isang light-weight API na nasa taas ng ODM. Ina-allow nito ang gumagamit ng aplikasyon na ma-access ang mga functions ng ODM sa computer network.

source: **WebODM** is a friendly user interface that includes a map viewer, a 3D viewer, user logins, a plugin system and many other features that are expected of modern drone mapping platforms
fil: Ang **WebODM** ay isang friendly user na interface na may kasamang map viewer, 3D viewer, user logins, plugin system at marami pang iba na ine-expect sa modern drone mapping platforms.

source: **CloudODM** is a small command line client to communicate with ODM via the NodeODM API
fil: Ang **CloudODM** ay isang maliit na command line client na nagcocommunicate sa ODM via NodeODM API

source: **PyODM** is a Python SDK for creating tasks via the NodeODM API. We cover it in more detail in the “Automated Processing With Python” chapter
fil: Ang **PyODM** ay Python SDK na gumagawa ng tasks via NodeODM API. Mababasa ang detalye sa “Automated Processing With Python” na chapter

source: **ClusterODM** is a load balancer for connecting together multiple NodeODM instances
fil: Ang **ClusterODM** ay isang load balancer na pang connect ng multiple NodeODM instances

source: ODM, NodeODM and WebODM are available on all major platforms (Windows, macOS and Linux) via a program called docker, which is required to run the software. Docker offers a way to run “containers”. Containers are packaged copies of an entire system, its software and its dependencies. These containers run within a virtual environment. On Linux this virtual environment is available from the operating system and is very efficient. On macOS and Windows the containers run within a VM, so there’s a bit of a overhead. but it’s still very suitable for running the software. Once installed users do not have to worry much about docker, as it operates (almost) transparently.
fil: Ang ODM, NoteODM at WebODM ay mayroon sa lahat ng pangunahin na plataporma (Windows, macOS at Linux) sa pamamagitan ng programang docker, na kailangan para patakbuhin ang software. Ang docker ay naghahandog ng paraan kung paano patatakbuhin ang “containers”. Ang containers ay kaha ng mga kopya ng kabuoan na sisyema, ang software nito at ang dependencies. Ang mga container na ito ay tumatakbo sa loob ng virtual environment. Sa linux, mayroong virtual environment sa operating system at ito ay mahusay na klase. Sa macOS at Windows naman, ang container ay napapatakbo sa pamamagitan ng VM, so may kaunting oberhed ngunit naaangkop pa rin sa pagpapatakbo ng software. Kapag na-install, ang gagamit ay hindi na kelangan magalala sa docker dahil ito ay gumagana (madalas) ng malinaw.

source: Without docker it would not be possible to run ODM on Windows or macOS. On these platforms ODM cannot run natively. Future development efforts are being focused on leveraging the new Windows Subsystem for Linux (WSL) and the possibility to make a native port of all dependencies to macOS, which is going to make the installation much easier.
fil: Kung walang docker, hindi posible na magpatakbo ng ODM sa macOS at Windows. Sa mga plataporma na ito, ang ODM ay hindi tatakbo ng kusa. Ang paghahanada para sa susunod na debelopment ay nakatuon sa pagkilos sa makabagong Windows Subsystem para sa Linux (WSL) at ang posibilidad na gawing native port ng lahat ng dependencies sa macOS na makakapagpadali sa pagi-install.

source: On Ubuntu Linux 18.04 it’s feasible to run all OpenDroneMap software natively. However, because there’s very little performance penalty for running docker on Linux and docker is straightforward to setup on this platform, we don’t recommend it. On Linux the advantages of containerization far outweigh a tiny performance penalty. With docker users also get easy one-step updates of the software, so that’s nice.
fil: Sa Ubuntu Linux 18.04 kaya patakbuhin ang lahat ng OpenDroneMap software. Ngutin, sa kadahilanan na may maliit na performance penalty sa pagpapatakbo ng docker sa Linux, and docker ay diretso sa pagset-up sa plataporma nito. Ito ay hindi inirerekomenda. Sa Linux, ang kalamangan ng containerization ay higit na malaki sa maliit na performance penalty. Sa docker, ang gagamit ay makakakuha ng mas madali na one-step updates ng software so ito ay maganda.

source: The bare minimum requirements for running the software are:
fil: Ang pinakakonti na bilang ng requirements para patakbuhin ang software ay:

source: No more than 100-200 images can be processed with the above specifications (the software will run out of memory). Recommended requirements are:
fil: Hindi hihigit sa 100-200 na imahe ang kayang iprocess ng nabanggit na specification sa taas (mauubusan ng memory ang software). Ang mga rekomendado na requirement ay:

source: Latest Generation CPU
fil: Pinakabago na Generation CPU

source: The above will allow for a few hundred images to be processed without too many issues. A CPU with more cores will allow for faster processing, while a graphics card (GPU) currently has no impact on performance. For processing more images, add more disk space and RAM linearly to the number of images you need to process.
fil: Ang nasa taas ay papayagan ang ilang daan na imahe na maprocess ng walang masyadong issue. Ang CPU na maraming core ay papahintulutan ang mas mabilis na pagproseso, samantalang ang graphics card (GPU) naman ay kasalukuyan na walang epekto sa performance. para sa pagprocess ng mas maraming imahe, magdagdag ng mas maraming disk space sa RAM linearly para sa bilang ng imahe na kailangan iprocess.

source: We recommend people use `docker <https://www.docker.com>`_ for running ODM, whether you are on Windows, macOS or Linux.
fil: Nirerekomenda na gamitin ang `docker <https://www.docker.com>`_ para patakbuhin ang ODM, ikaw man ay gumagamit ng Windows, macOS o Linux.

source: To run OpenDroneMap you need at least Windows 7. Previous versions of Windows are not supported.
fil: Para patakbuhin ang OpenDroneMap, kailangan mo ng kahit man lang Windows 7. Ang mga mas luma na bersiyon ng Windows ay hindi suportado.

source: Step 1. Check Virtualization Support
fil: Step 1. I-check Virtualization Support

source: Docker requires a feature from your CPU called virtualization, which allows it to run virtual machines (VMs). Make sure you have it enabled! Sometimes this is disabled. To check, on Windows 8 or higher you can open the **Task Manager** (press CTRL+SHIFT+ESC) and switch to the **Performance** tab.
fil: Ang docker ay nangangailangan ng feature sa CPU na tinatawag na virtualization, ina-allow nito na patakbuhin ang virtual machines (VMs). Siguraduhin na ito ay enabled! Minsan ito ay disabled. Para i-check sa Windows 8 o mas mataas na bersiyon, buksan ang **Task Manager** (press CTRL+SHIFT+ESC) at i-switch sa **Performance** tab.

source: On Windows 7 to see if you have virtualization enabled you can use the `Microsoft® Hardware-Assisted Virtualization Detection Tool <http:// www.microsoft.com/en-us/download/details.aspx?id=592>`_ instead.
fil: Sa Windows 7, para makita kung naka-enable ang virtualization,

source: If virtualization is disabled, you’ll need to enable it. The procedure unfortunately is a bit different for each computer model, so the best way to do this is to look up on a search engine “how to enable vtx for <type your computer model here>”. Often times it’s a matter of restarting the computer, immediately pressing F2 or F12 during startup, navigating the boot menu and changing the settings to enable virtualization (often called “VT-X”).
fil: Kung ang virtualization ay hindi gumagana, kailangan paganahin ito. Bagamat ang proseso ay higit na iba kada modelo ng komputer. Ang pinakamainam na paraan para gawin ito ay ang hanapin sa search engine ang “how to enable vtx for 1”. Kadalasan, kailangan ire-start ang kompyuter, mabilis na pagpindot ng F2 o F12 habang start-up, ang pag-navigate ng boot menu at pagpalit ng settings para mapahintulot ang virtualization (madals na tinatawag na “VT-X”).

source: First, you’ll need to install:
fil: Una, kailangan mong ma-install:

source: For Python 3, make sure you check **Add Python 3.x to PATH** during the installation.
fil: Para sa Python 3, siguraduhin na i-check ang **Add Python 3.x to PATH** habang iniinstall.

source: Then, only if you are on Windows 10 Home, Windows 8 (any version) or Windows 7 (any version), install:
fil: Kapag ikaw ay nasa Windows 10 Home, Windows 8 (kahit anong bersiyon) o WIndows 7 (kahit anong bersiyon), i-install:

source: If you are on Windows 10 Professional or a newer version, you should install instead:
fil: Kung ang gamit ay Windows 10 Professional o mas bagong bersiyon, dapat i-install ito:

source: Please do **NOT** install both docker programs. They are different and will create a mess if they are both installed.
fil: **HUWAG** i-install ng sabay ang dalawang docker na programa. Sila ay magkaiba at maaring mahdulot ng gulo sa sistema.

source: After installing docker, launch it from the Desktop icon that is created from the installation (**Docker Quickstart** in the case of Docker Toolbox, **Docker for Windows** for Docker for Windows). This is important, do not skip this step. If there are errors, follow the prompts on screen to fix them.
fil: Matapos i-install ang docker, simulan ito mula sa Desktop icon na ginawa mula sa installation (**Docker Quickstart** sa kaso ng Docker Toolbox, **Docker for Windows** para sa Docker na pang-Windows). Ito ay importante, wag lagpasan ang hakbang na ito. Kung may kamalian, sundan ang mga nakadikta sa screen para ayusin ito.

source: Step 3. Check Memory and CPU Allocation
fil: Step 3. I-check ang Memory at CPU Allocation

source: Docker on Windows works by running a VM in the background (think of a VM as a “computer emulator”). This VM has a certain amount of memory allocated and WebODM can only use as much memory as it’s allocated.
fil: Ang docker sa Windows ay tumatakbo sa pamamagitan ng VM sa likod (isipin ang VM bilang “computer emulator”). Ang VM na ito ay may sapat ng laki ng memory na nakasubi at ang WebODM ay makakagamit lamang ng sapat na memorya na nakatabi para sa kanya.

source: If you installed Docker Toolbox (see below if you installed Docker for Windows instead):
fil: Kung Docker Toolbox ang naka-install (tignan ang nasa ibaba kung Docker ang naka-install sa Windows):

source: Open the **VirtualBox Manager** application
fil: Buksan ang **VirtualBox Manager** application

source: Right click the **default** VM and press **Close (ACPI Shutdown)** to stop the machine
fil: i-right click ang **default** ang VM at pindutin ang **Close (ACPI Shutdown)** para tumigil ang machine

source: Right click the **default** VM and press **Settings...**
fil: i-right click ang **default** ang VM at pindutin ang **Settings...**

source: Move the **Base Memory** slider from the **System** paneland allocate 60-70% of all available memory, optionally adding 50% of the available processors from the **Processor** tab also
fil: I-move ang **Base Memory** nslider mula sa **System** panel at magallocate ng 60-70% ng available na memory, optionally dinadagdagan din ng 50% ng available processors mula sa **Processor** tab

source: Then press **OK**, right click the **default** VM and press **Start**.
fil: Pindutin ang **OK**, i-right click ang **default** VM at pindutin ang **Start**.

source: If you installed Docker for Windows instead:
fil: Kung Docker para sa Windows ang naka-install:

source: Look in the system tray and right click the “white whale” icon.
fil: Tignan ang system tray at i-right click ang "white whale" na icon.

source: From the menu, press **Settings...**
fil: Mula sa menue, i-press ang **Settings...**

source: From the panel, click **Advanced** and use the sliders to allocate 60-70% of available memory and use half of all available CPUs.
fil: Mula sa panel, i-click ang **Advanced** at gamitin ang sliders para maisubi ang 60-70% na memory at gamitin ang kalahati ng available sa CPUs.

source: Press **Apply**.
fil: Pindutin ang **Apply**.

source: Open the **Git Gui** program that comes installed with Git. From there:
fil: Buksan ang **Git Gui** na programa na kasama Git. galing dito:

source: When Git Gui opens, click 'Clone Existing Repository' option
fil: Kapag nabuksan na ang Git Gui, i-click ang 'Clone Existing Repository' na option

source: In **Source Location** type: https://github.com/OpenDroneMap/WebODM
fil: Mula sa **Source Location** i-type ang: https://github.com/OpenDroneMap/WebODM

source: In **Target Directory** click browse and navigate to a folder of your choosing (create one if necessary)
fil: Mula sa **Target Directory** i-click ang browse at magnavigate sa folder na gusto mo (gumawa ng folder kung kinakailangan)

source: Press **Clone**
fil: Pindutin ang **Clone**

source: If the download succeeded, you should now see this window:
fil: Kung ang pagda-download ay successful, makikita ang window na ito:

source: Go to the **Repository** menu, then click **Create Desktop Icon**. This will allow you to come back to this application easily in the future.
fil: Pumunta sa **Repository** menu at i-click ang **Create Desktop Icon**. Matutulungan ka nito na bumalik sa madaling makapunta sa aplikasyon na ito balang araw.

source: From Git Gui, go to the **Repository** menu, then click **Git Bash**. From the command line terminal type:
fil: Mula sa Git Gui, pumunta sa **Repository** menu at i-click ang **Git Bash**. Mula sa command line terminal i-type ang:

source: Several components will download to your machine at this point, including WebODM, NodeODM and ODM. After the download you should be greeted by the following screen:
fil: Iba't ibang components na ang nadownload dapat ng iyong computer sa point na ito. Kasama na rito ang WebODM, NodeODM at ODM. Matapos ang pagda-download, ikaw ay babatiin ng mga sumusunod na mensahe sa screen:

source: If you are using Docker for Windows, open a web browser to http://localhost:8000
fil: Kung ikaw ay gumagamit ng Docker for Windows, buksan ang web browser sa http://localhost:8000

source: If you are using Docker Toolbox, find the IP address to connect to by typing:
fil: Kung ikaw ay gumagamit ng Docker Toolbox, hanapin ang IP address na magcoconnect sayo sa pamamagitan ng pagtype nito:

source: You should get a result like the following:
fil: Dapat makatanggap ng resulta na katulad ng mga sumusunod:

source: Then connect to http://192.168.1.100:8000 (replacing the IP address with the proper one).
fil: Tapos, magconnect sa http://192.168.1.100:8000 (replacing the IP address with the proper one).

source: Most modern (post 2010) Mac computers running macOS Sierra 10.12 or higher can run OpenDroneMap using docker, as long as hardware virtualization is supported (see below).
fil: Karamihan ng modernong bersiyon ng Mac computers (post 2010) na may macOS Sierra 10.12 o mas mataas pa ay kayang gumamit ng OpenDroneMap gamit ang docker, hanggat ang hardware virtualization ay suportado (tignan ang nasa ibaba).

source: Open a Terminal window and type:
fil: Buksan ang Terminal na window at i-type ang:

source: You will get a response similar to the following:
fil: Makakatanggap ng mensahe na katulad ng mga sumusunod:

source: If the result is *kern.hv_support: 1*, then your Mac is supported! Continue with Step 2.
fil: Ang iyong Mac ay suportado kung ang resulta na lumalabas ay *kern.hv_support: 1*. Sundan ang hakbang bilang 2.

source: If the result is *kern.hv_support: 0*, unfortunately it means your Mac is too old to run OpenDroneMap. :(
fil: Ang sistema ng iyong Mac ay luma na hindi na kakayanin ang OpenDroneMap kapag ang resulta na lumabas ay *kern.hv_support: 0*. :(

source: There are only two programs to install:
fil: Mayroon lamang dalawang programa na dapat i-install:

source: Docker: https://download.docker.com/mac/stable/Docker.dmg
fil: Ang Docker: https://download.docker.com/mac/stable/Docker.dmg

source: Git: https://sourceforge.net/projects/git-osx-installer/files/
fil: At ang Git: https://sourceforge.net/projects/git-osx-installer/files/

source: After installing docker you should find an icon that looks like a whale in the task bar.
fil: Matapoa i-install ang docker, makikita ang simbolo na mukang balyena sa task bar.

source: *Docker app running*
fil: *Ang Docker app ay tumatakbo*

source: You can verify that docker is running properly by opening the **Terminal** app and typing:
fil: Upang masigurado na tumatakbo ng matiwasay ang docker, buksan ang **Terminal** na app at i-type ang mga sumusunod:

source: Which should return
fil: Na dapat ay bumalik

source: To verify that git is installed, simply type:
fil: Para masigurado na ang git ay na-install, i-type ang:

source: Which should return something similar to the following:
fil: Na may babalik dapat na malapit sa mga sumusunod:

source: If you get a “bash: git: command not found”, try to restart your **Terminal** app and double-check for any errors during the install process.
fil: Kapag nakatanggap ng “bash: git: command not found”, i-restart ang **Terminal** app at suriing mabuti kung may mga error habang inagi-install.

source: Docker on macOS works by running a VM in the background (think of it as a “computer emulator”). This VM has a certain amount of memory allocated and WebODM can only use as much memory as it’s allocated.
fil: Ang docker ay tumatakbo lamang sa macOS sa pamamagitan ng paggamit ng VM sa background (isipin na ito ay parang "computer emulator"). Ang VM na ito ay may limitadong alokasyon lamang ng memorya para sa WebODM.

source: Right click the whale icon from the task bar and click **Preferences**...
fil: I-right click ang balyena na simbulo sa task bar at piliin ang **Preferences**...

source: Select the **Advanced** tab
fil: Piliin ang **Advanced** tab

source: Adjust the CPUs slider to use half of all available CPUs and the memory to use 60-70% of all available memory
fil: I-adjust ang CPU slider para magamit ang kalahato ng kabuoang CPU at ang memoryang magagamit ay 60-70% ng kabuoang memorya.

source: Press **Apply & Restart**
fil: Pindutin ang *Apply & Restart**

source: Step 4. Download and Launch WebODM
fil: Step 4. I-download at i-launch ang WebODM

source: From a **Terminal** type:
fil: Mula sa **Terminal** i-type ang:

source: Then open a web browser to http://localhost:8000.
fil: Tapos buksan ang web browser sa http://localhost:8000.

source: OpenDroneMap can run on any Linux distribution that supports docker. According to `docker’s documentation website <https://docs.docker.com/install/>`_ the officially supported distributions are CentOS, Debian, Ubuntu and Fedora, with static binaries available for others. If you have to pick a distribution solely for running OpenDroneMap, Ubuntu is the recommended way to go.
fil: Ang OpenDroneMap ay makakatakbo lamang sa kahit anong Linux na distribusyon na nagsusuporta sa docker. Ayon sa `docker’s documentation website <https://docs.docker.com/install/>`_ ang opisyal nasuportadong distribusyon ay ang CentOS, Debian, Ubuntu at Fedora, na may static binaries na mayroon para sa iba. Kung ikaw ay pipili ng distribusyon para sa pagpapatakbo ng OpenDroneMap, Ubunto ang rekomendado.

source: Step 1. Install Requirements
fil: Step 1. Mga kailangan bago maginstall.

source: There are four programs that need to be installed:
fil: May apat na programa na dapat ma-install:

source: We cannot possibly cover the installation process for every Linux distribution out there, so we’ll limit the instructions to those that are distributions officially supported by docker. In all cases it’s just a matter of opening a terminal prompt and typing a few commands.
fil: Hindi pwedeng takpan ang process ng installation kada Linux na distribusyon, kaya lilimitahan na lamang ang instruksiyon para sa distribusyon na opisyal na pang docker. Sa lahat ng kaso, ito ay isang bagay na pangbukas o terminal prompt at ang pag-type ng ilan na commands.

source: Install on Ubuntu / Debian
fil: Maginstall sa Ubuntu / Debian

source: Commands to type:
fil: Mga command na ita-type:

source: Install on CentOS / RHEL
fil: Maginstall sa CentOS / RHEL

source: Install on Fedora
fil: Maginstall sa Fedora

source: Install on Arch
fil: Maginstall sa Arch

source: Step 2. Check Additional Requirements
fil: Step 2. I-check ang mga karagdagan na requirements

source: In addition to the three programs above, the dockercompose script is also needed. Sometimes it’s already installed with docker, but sometimes it isn’t. To verify if it’s installed try to type:
fil: Bukod sa mga tatlong programa sa taas, ang dockercompose script ay kailangan din. Minsan, ito ay installed na kasama ng docker at minsan naman ay hindi. Para ma-verify kung ito ay nakainstall na, itype ang:

source: You should see somethings similar to the following:
fil: Dapat makita ang mga sumusunod:

source: If instead you get something similar to the following:
fil: Kung makatanggap naman ng mensahe na katulad ng sumusunod:

source: you can install it by using pip:
fil: Mai-install mo ito gamit ang pip:

source: From a terminal type:
fil: Mula sa terminal i-type ang:

source: Basic Commands and Troubleshooting
fil: Basic na mga cCommands at Troubleshooting

source: The cool thing about using docker is that 99% of the tasks you’ll ever need to perform while using WebODM can be done via the ./webodm.sh script. You have already encountered one of them:
fil: Ang mainam na bagy sa paggamit ng dockey ay 99% ng mmga task na kailangan gamitin habang gamit ang WebODM ay magagawa sa pamamagitan ng ./webodm.sh script. Ikaw ay naka-encounter na ng isa sa mga ito:

source: which takes care of starting WebODM and setting up a default processing node (node-odm-1). If you want to stop WebODM, you can already guess what the command is:
fil: na nangangalaga sa pagsisimula ng WebODM at setting-up ng default processing node (node-odm-1). Kung gusto pahintuin ang WebODM, pwede ng hulaan kung ano ang command:
