Repository: OpenDroneMap/docs
Catalog: source/locale/*/LC_MESSAGES/installation.po
Languages: fil

source: There are several other commands you can use, along with different flags. Flags are parameters passed to the ./webodm.sh command and are typically prefixed with “–”. The **port** flag for example instructs WebODM to use a different network port:
fil: Marami ang ibang commands na pwede gamitin kasama ng iba't-ibang flags. Ang flags ay parameter na ipinapasa sa ./webodm.sh command na may tipikal na prefix na “–”. Ang **port** flag halimbawa ay nagiinstruct sa WebODM na gamitin ang iba't-ibang network port:

source: Other useful commands are listed below:
fil: Ang ibang importanteng commands ay nakalista sa baba:

source: `The community forum <https://community.opendronemap.org>`_ is a great place to ask for help if you get stuck during any of the installation steps and for general questions on using the ./webodm.sh script.
fil: Ang community forum na <https://community.opendronemap.org>`_ ay magandang lugar na pagtanungan kapag ikaw ay na-stuck sa kahit anong mga hakbang pangi-installasyon at para sa mga general na katanungan kung paano gumamit ng ./webodm.sh script.

source: After running ./webodm.sh start and opening WebODM in the browser, you will be greeted with a welcome message and will be asked to create the first user. Take some time to familiarize yourself with the web interface and explore its various menus.
fil: Matapos patakbuhin ang ./webodm.sh simulan at buksan ang WebODM sa browser, ikaw ay makatatanggap ng pangbungad na mensahe at tatanungin na gawin ang first user. Bigyang oras at pagsanayan ang web interface at i-explore ang various menus.

source: Notice that under the **Processing Nodes** menu there’s a "node-odm-1" node already configured for you to use. This is a NodeODM node and has been created automatically by WebODM. This node is running on the same machine as WebODM.
fil: Pansinin na sa ilalim ng **Processing Nodes** menu ay may "node-odm-1" node ay na-configure para sa iyo. Ito ay NodeODM node at nagawa ng awtomatik ng WebODM. Ang node na ito ay gumagana sa parehong machine tulad ng WebODM.

source: If you’ve made it this far, congratulations! Now it’s time to start processing some data.
fil: Kung umabot ka na sa ganito kalayo, congratulations! Oras na para simulan ang pagprocess ng mga data.

source: Running on more than one machine
fil: Pagpapatakbo sa dalawa o mas marami pang machine

source: **Optionally:** If you have another computer, you can repeat the installation process (install docker, git, python, etc.) and launch a new NodeODM node by typing from a Terminal/Git Bash window:
fil: **Optionally:** Kung ikaw ay may isa pang computer, mauulit mo ang installation process (install docker, git, python, etc.) at i-launch ang bagong NodeODM node sa pagta-type mula sa Terminal/Git Bash window:

source: The above command asks docker to launch a new container using the opendronemap/nodeodm image from Docker Hub (the latest version of NodeODM), using port 3000, setting a maximum number of concurrent tasks to 1 and to protect the node from unauthorized access using the password "secret".
fil: Ang command sa taas ay nagre-require kay docker na i-launch ang makabagong container gamit ang opendronemap/nodeodm image mula sa Docker Hub (pinakabagong bersiyon ng NodeODM), gamit ang port 3000, nagset ng pinakamataas na bilang ng concurrent tasks mula 1 at pinoprotektahan ang node mula sa hindi pinapahintulutan na pag-access gamit ang password na "secret".

source: From WebODM you can then press the **Add New** button under **Processing Nodes**. For the **hostname/IP** field type the IP of the second computer. For the **port** field type “3000”. For the **token** field type “secret”. You can also add an optional **label** for your node, such as “second computer”. Then press **Save**.
fil: Mula sa WebODM pwede mong piliin ang **Add New** button under **Processing Nodes**. Para sa **hostname/IP** field i-type ang IP ng pangalawang computer. Para sa **port** field type “3000”. Para sa **token** field type “secret”. Pwede mo rin dagdagan ng optional na **label** para sa iyong node, katulad ng “second computer”. Then press **Save**.

source: If everything went well, you should now have two processing nodes! You will be able to process multiple tasks in parallel using two different machines.
fil: Kung ang lahat ay nagawa ng maayos, dapat ay mayroon ka nang dalawang processing nodes! Kaya ng magprocess ng multiple tasks in parallel gamit ang dalawang magkaiba na machines.
