Repository: OpenDroneMap/docs
Catalog: source/locale/*/LC_MESSAGES/map-accuracy.po
Languages: es, te

source: Map accuracy
es: Precisión del Mapa
te: మ్యాప్ ఖచ్చితత్వం

source: Accuracy can be defined as the degree or closeness to which the information on a map matches the values in the real world. Therefore, when we refer to accuracy, we are talking about quality of data and about number of errors contained in a certain dataset (Pascual 2011).
es: La precisión se puede definir como el grado o la cercanía con la que la información de un mapa coincide con los valores del mundo real. Por tanto, cuando nos referimos a la precisión, nos referimos a la calidad de los datos y al número de errores contenidos en un determinado conjunto de datos (Pascual 2011).
te: మ్యాప్‌లోని సమాచారం వాస్తవ ప్రపంచంలోని విలువలతో సరిపోయే డిగ్రీ లేదా సాన్నిహిత్యాన్ని ఖచ్చితత్వాన్ని నిర్వచించవచ్చు. అందువల్ల, మేము ఖచ్చితత్వాన్ని సూచించినప్పుడు, మేము డేటా నాణ్యత గురించి మరియు ఒక నిర్దిష్ట డేటాసెట్ (పాస్కల్ 2011) లో ఉన్న లోపాల సంఖ్య గురించి మాట్లాడుతున్నాము.

source: **Relative or Local accuracy**
es: **Precisión Relativa o Local**
te: ** సాపేక్ష లేదా స్థానిక ఖచ్చితత్వం **

source: Local or relative accuracy can be defined as the degree to which de distances between two points on a map correspond to the actually distances between those points in the real world.
es: La precisión local o relativa se puede definir como el grado en que las distancias entre dos puntos en un mapa corresponden a las distancias reales entre esos puntos en el mundo real.
te: స్థానిక లేదా సాపేక్ష ఖచ్చితత్వాన్ని మ్యాప్‌లోని రెండు పాయింట్ల మధ్య దూరం వాస్తవ ప్రపంచంలో ఆ పాయింట్ల మధ్య దూరాలకు అనుగుణంగా ఉంటుంది.

source: Relative accuracy is independent of the location of the map in the world, so a map can have a high relative accuracy (in size and shape) but its position in the world can be shifted (Figure 1).
es: La precisión relativa es independiente de la ubicación del mapa en el mundo, por lo que un mapa puede tener una precisión relativa alta (en tamaño y forma), pero su posición en el mundo se puede cambiar (Figura 1).
te: సాపేక్ష ఖచ్చితత్వం ప్రపంచంలోని మ్యాప్ యొక్క స్థానానికి స్వతంత్రంగా ఉంటుంది, కాబట్టి మ్యాప్ అధిక సాపేక్ష ఖచ్చితత్వాన్ని కలిగి ఉంటుంది (పరిమాణం మరియు ఆకారంలో) కానీ ప్రపంచంలో దాని స్థానాన్ని మార్చవచ్చు (మూర్తి 1).

source: *Figure 1. Model showing high relative accuracy but misplaced according to its real world position*
es: *Figura 1. Modelo que muestra una alta precisión relativa pero está fuera de lugar según su posición en el mundo real*
te: * మూర్తి 1. అధిక సాపేక్ష ఖచ్చితత్వాన్ని చూపించే మోడల్ కానీ దాని వాస్తవ ప్రపంచ స్థానం ప్రకారం తప్పుగా ఉంచబడింది *

source: **Absolute or global Accuracy**
es: **Precisión absoluta o global**
te: ** సంపూర్ణ లేదా ప్రపంచ ఖచ్చితత్వం **

source: Absolute accuracy is the accuracy of the reconstruction in relation to its true position on the planet (Pix4D 2019). Figure 2 shows a relative and absolute accurate model, as the points are correctly placed according to its real world position.
es: La precisión absoluta es la precisión de la reconstrucción en relación con su posición real en el planeta (Pix4D 2019). La Figura 2 muestra un modelo de precisión relativa y absoluta, ya que los puntos están colocados correctamente de acuerdo con su posición en el mundo real.
te: సంపూర్ణ ఖచ్చితత్వం అంటే గ్రహం మీద దాని నిజమైన స్థానానికి సంబంధించి పునర్నిర్మాణం యొక్క ఖచ్చితత్వం (పిక్స్ 4 డి 2019). మూర్తి 2 సాపేక్ష మరియు సంపూర్ణ ఖచ్చితమైన నమూనాను చూపిస్తుంది, ఎందుకంటే పాయింట్లు దాని వాస్తవ ప్రపంచ స్థానం ప్రకారం సరిగ్గా ఉంచబడతాయి.

source: *Figure 2. Model showing high relative and absolute accuracy. Placed correctly according to its real world position*
es: *Figura 2. Modelo que muestra una alta precisión relativa y absoluta. Colocado correctamente de acuerdo con su posición en el mundo real*
te: * మూర్తి 2. అధిక సాపేక్ష మరియు సంపూర్ణ ఖచ్చితత్వాన్ని చూపించే మోడల్. దాని వాస్తవ ప్రపంచ స్థానం ప్రకారం సరిగ్గా ఉంచబడింది *

source: **An Accuracy level for each project**
es: ** Un nivel de precisión para cada proyecto**
te: ** ప్రతి ప్రాజెక్ట్ కోసం ఖచ్చితత్వం స్థాయి **

source: Each project has specific accuracy needs to be met. For instance assessing the progress in a construction site or measuring an area affected by a fire does not require the use of GCP, since absolute accuracy will not impact the decision making process. In the other hand, there are tasks on which accuracy is critical, for example project compliance evaluations and land title surveying, which require a higher relative and absolute accuracy.
es: Cada proyecto tiene necesidades específicas de precisión que se deben cumplir. Por ejemplo, evaluar el progreso en un sitio de construcción o medir un área afectada por un incendio no requiere el uso de GCP, ya que la precisión absoluta no afectará el proceso de toma de decisiones. Por otro lado, hay tareas en las que la precisión es fundamental, por ejemplo, evaluaciones de cumplimiento de proyectos y levantamiento de títulos de propiedad, que requieren una mayor precisión relativa y absoluta.
te: ప్రతి ప్రాజెక్ట్ నిర్దిష్ట ఖచ్చితత్వాన్ని కలిగి ఉండాలి. ఉదాహరణకు, నిర్మాణ స్థలంలో పురోగతిని అంచనా వేయడం లేదా అగ్నిప్రమాదం సంభవించిన ప్రాంతాన్ని కొలవడం GCP యొక్క ఉపయోగం అవసరం లేదు, ఎందుకంటే సంపూర్ణ ఖచ్చితత్వం నిర్ణయం తీసుకునే ప్రక్రియను ప్రభావితం చేయదు. మరోవైపు, ఖచ్చితత్వం కీలకమైన పనులు ఉన్నాయి, ఉదాహరణకు ప్రాజెక్ట్ వర్తింపు మూల్యాంకనాలు మరియు భూమి టైటిల్ సర్వేయింగ్, దీనికి అధిక సాపేక్ష మరియు సంపూర్ణ ఖచ్చితత్వం అవసరం.

source: What to expect
es: Que esperar
te: ఏమి ఆశించను

source: In general terms, one can expect the relative accuracy to be in the order of 1 to 3 times the average GSD for the dataset. And as for the absolute accuracy, one must consider that it is dependent of the GPS unit mounted in the UAV but the horizontal accuracy of a standard GPS is usually in the range of 2 to 6 meters and the vertical accuracy between 3 to 4 times the horizontal accuracy.
es: En términos generales, se puede esperar que la precisión relativa sea del orden de 1 a 3 veces el GSD promedio para el conjunto de datos. Y en cuanto a la precisión absoluta, se debe considerar que depende de la unidad GPS montada en el UAV pero la precisión horizontal de un GPS estándar suele estar en el rango de 2 a 6 metros y la precisión vertical entre 3 y 4 veces la precisión horizontal.
te: సాధారణ పరంగా, డేటాసెట్ కోసం సగటు ఖచ్చితత్వం 1 నుండి 3 రెట్లు సాపేక్ష ఖచ్చితత్వం ఉంటుందని ఎవరైనా ఆశించవచ్చు. మరియు సంపూర్ణ ఖచ్చితత్వానికి, ఇది UAV లో అమర్చిన GPS యూనిట్ మీద ఆధారపడి ఉంటుందని పరిగణించాలి కాని ప్రామాణిక GPS యొక్క క్షితిజ సమాంతర ఖచ్చితత్వం సాధారణంగా 2 నుండి 6 మీటర్ల పరిధిలో ఉంటుంది మరియు నిలువు ఖచ్చితత్వం 3 నుండి 4 రెట్లు మధ్య ఉంటుంది సమాంతర ఖచ్చితత్వం.

source: When using GCP, absolute accuracy can be improved to 2.5 times GSD for the horizontal accuracy and 4 times the GSD for the vertical accuracy (Madawalagama 2016).
es: Cuando se utiliza GCP, la precisión absoluta se puede mejorar a 2,5 veces GSD para la precisión horizontal y 4 veces la GSD para la precisión vertical (Madawalagama 2016).
te: GCP ని ఉపయోగిస్తున్నప్పుడు, క్షితిజ సమాంతర ఖచ్చితత్వానికి సంపూర్ణ ఖచ్చితత్వాన్ని 2.5 రెట్లు GSD మరియు నిలువు ఖచ్చితత్వానికి 4 రెట్లు GSD గా మెరుగుపరచవచ్చు (మాడవాలాగామా 2016).

source: At a GSD of 1cm, the accuracy is to that of the RTK GNSS, and is within 1:200 scales according to NSDI & FGDC mapping accuracy standards during sub-optimal conditions (Barry 2013).
es: A un GSD de 1 cm, la precisión es igual a la del RTK GNSS, y está dentro de las escalas de 1:200 según los estándares de precisión de mapeo NSDI y FGDC durante condiciones subóptimas (Barry 2013).
te: 1 సెం.మీ. యొక్క GSD వద్ద, ఖచ్చితత్వం RTK GNSS కు ఉంటుంది మరియు ఇది ఉప-ఆప్టిమల్ పరిస్థితులలో (బారీ 2013) NSDI & FGDC మ్యాపింగ్ ఖచ్చితత్వ ప్రమాణాల ప్రకారం 1: 200 ప్రమాణాలలో ఉంటుంది.

source: Aspects impacting map accuracy
es: Aspectos que impactan la precisión del mapa
te: మ్యాప్ ఖచ్చితత్వాన్ని ప్రభావితం చేసే అంశాలు

source: **Weather**
es: **Clima**
te: ** వాతావరణం **

source: Weather conditions have direct impact in the photogrammetry results, so it is important to consider cloud coverage, wind speed, humidity, sun’s altitude and other factors influencing the UAV stability and terrain illumination.
es: Las condiciones climáticas tienen un impacto directo en los resultados de la fotogrametría, por lo que es importante considerar la cobertura de nubes, la velocidad del viento, la humedad, la altitud del sol y otros factores que influyen en la estabilidad del UAV y la iluminación del terreno.
te: ఫోటోగ్రామెట్రీ ఫలితాల్లో వాతావరణ పరిస్థితులు ప్రత్యక్ష ప్రభావాన్ని చూపుతాయి, కాబట్టి క్లౌడ్ కవరేజ్, గాలి వేగం, తేమ, సూర్యుడి ఎత్తు మరియు UAV స్థిరత్వం మరియు భూభాగ ప్రకాశాన్ని ప్రభావితం చేసే ఇతర అంశాలను పరిగణనలోకి తీసుకోవడం చాలా ముఖ్యం.

source: **Cameras**
es: **Cámaras**
te: ** కెమెరాలు **

source: Bigger and better sensors produce less noise and more clearly focused images. Also consider that rolling shutter cameras produce distorted images when the UAV is moving, so global or mechanical shutter cameras are advised for mapping jobs.
es: Los sensores más grandes y mejores producen menos ruido e imágenes más claramente enfocadas. También tenga en cuenta que las cámaras con obturador "rolling shutter" producen imágenes distorsionadas cuando la UAV se está moviendo, por lo que para las actividades de mapeo, se recomiendan las cámaras con obturador mecánico o global.
te: పెద్ద మరియు మంచి సెన్సార్లు తక్కువ శబ్దం మరియు స్పష్టంగా దృష్టి కేంద్రీకరించిన చిత్రాలను ఉత్పత్తి చేస్తాయి. యుఎవి కదులుతున్నప్పుడు రోలింగ్ షట్టర్ కెమెరాలు వక్రీకరించిన చిత్రాలను ఉత్పత్తి చేస్తాయని కూడా పరిగణించండి, కాబట్టి మ్యాపింగ్ ఉద్యోగాల కోసం గ్లోబల్ లేదా మెకానికల్ షట్టర్ కెమెరాలు సూచించబడతాయి.

source: **Flight altitude**
es: **Altitud del vuelo**
te: ** విమాన ఎత్తు **

source: The higher the flight altitude, the larger the image footprint and GSD. The resulting larger GSD the accuracy will be decreased as there will be less detail in the recognizable features. When a smaller GSD is required an altitude of 3 to 4 times the height of the highest point is recommended.
es: Cuanto mayor sea la altitud de vuelo, mayor será la huella de la imagen y el GSD. Con el GSD más grande resultante, la precisión disminuirá ya que habrá menos detalles en las características reconocibles. Cuando se requiere un GSD más pequeño, se recomienda una altitud de 3 a 4 veces la altura del punto más alto.
te: ఫ్లైట్ ఎత్తులో ఎక్కువ, ఇమేజ్ పాదముద్ర మరియు జిఎస్‌డి పెద్దవి. గుర్తించదగిన లక్షణాలలో తక్కువ వివరాలు ఉన్నందున ఫలితమయ్యే పెద్ద GSD ఖచ్చితత్వం తగ్గుతుంది. ఒక చిన్న GSD అవసరమైనప్పుడు ఎత్తైన ప్రదేశం యొక్క ఎత్తు 3 నుండి 4 రెట్లు ఎత్తుగా సిఫార్సు చేయబడింది.

source: **Flight speed**
es: **Velocidad del vuelo**
te: ** విమాన వేగం **

source: Flight speed have special effect in cameras equipped with rolling shutter, while those equipped with global or mechanical shutter tends to reduce this effect. UAV equipped with RTK positioning systems are also affected with the speed, but with hover at each photo taken, you can get very good accuracy. If instead you are moving during each photo take, the accuracy is going to be limited by two factors: the speed at which you are moving multiplied by the 1 second increments of RTK (Mather 2020).
es: La velocidad de vuelo tiene un efecto especial en las cámaras equipadas con obturador "rolling shutter", mientras que las equipadas con obturador global o mecánico tienden a reducir este efecto. Los UAV equipados con sistemas de posicionamiento RTK también se ven afectados por la velocidad, pero deteniendo la UAV en cada foto tomada, puede obtener una muy buena precisión. Si, en cambio, se está moviendo durante cada toma de fotos, la precisión estará limitada por dos factores: la velocidad a la que se está moviendo multiplicada por los incrementos de 1 segundo de RTK (Mather 2020).
te: రోలింగ్ షట్టర్ అమర్చిన కెమెరాల్లో విమాన వేగం ప్రత్యేక ప్రభావాన్ని చూపుతుంది, అయితే గ్లోబల్ లేదా మెకానికల్ షట్టర్ అమర్చినవి ఈ ప్రభావాన్ని తగ్గిస్తాయి. RTK పొజిషనింగ్ సిస్టమ్‌లతో కూడిన UAV కూడా వేగంతో ప్రభావితమవుతుంది, కానీ తీసిన ప్రతి ఫోటో వద్ద హోవర్‌తో, మీరు చాలా మంచి ఖచ్చితత్వాన్ని పొందవచ్చు. బదులుగా మీరు ప్రతి ఫోటో తీసేటప్పుడు కదులుతున్నట్లయితే, ఖచ్చితత్వం రెండు కారకాల ద్వారా పరిమితం చేయబడుతుంది: మీరు కదులుతున్న వేగం RTK (మాథర్ 2020) యొక్క 1 సెకండ్ ఇంక్రిమెంట్లతో గుణించబడుతుంది.

source: References
es: Referencias
te: ప్రస్తావనలు

source: Barry, P., & Coakley, R. «Accuracy of UAV photogrammetry compared with Network RTK GPS.» Baseline Surveys. 2013. http://uav.ie/PDF/Accuracy_UAV_compare_RTK_GPS.pdf (accessed 10 13, 2020).
te: బారీ, పి., & కోక్లీ, ఆర్. Network నెట్‌వర్క్ RTK GPS తో పోలిస్తే UAV ఫోటోగ్రామెట్రీ యొక్క ఖచ్చితత్వం. » బేస్లైన్ సర్వేలు. 2013. http://uav.ie/PDF/Accuracy_UAV_compare_RTK_GPS.pdf (10 13, 2020 న వినియోగించబడింది).

source: Drone Deploy. How Do I Use Ground Control Points?: A guide to using ground control points with drone mapping software. 5 8, 2017. https://www.dronedeploy.com/blog/what-are-ground-control-points-gcps/ (accessed 7 9, 2020).
es: Drone Deploy. How Do I Use Ground Control Points?: A guide to using ground control points with drone mapping software. 5 8, 2017. https://www.dronedeploy.com/blog/what-are-ground-control-points-gcps/ (último acceso el 9 del 7, 2020).
te: డ్రోన్ డిప్లాయ్. నేను గ్రౌండ్ కంట్రోల్ పాయింట్లను ఎలా ఉపయోగించగలను ?: డ్రోన్ మ్యాపింగ్ సాఫ్ట్‌వేర్‌తో గ్రౌండ్ కంట్రోల్ పాయింట్లను ఉపయోగించటానికి ఒక గైడ్. 5 8, 2017. https://www.dronedeploy.com/blog/what-are-ground-control-points-gcps/ (యాక్సెస్ చేయబడింది 7 9, 2020).

source: Madawalagama, S.L., Munasinghe, N., Dampegama, S.D.P.J. and Samarakoon, L. «Low-cost aerial mapping with consumer grade.» 37th Asian Conference on Remote Sensing. Colombo, Sri Lanka, 2016.
te: మదవాలాగామ, ఎస్.ఎల్., మునసింగ్, ఎన్., దంపేగామ, ఎస్.డి.పి.జె. మరియు సమరకూన్, ఎల్. consu వినియోగదారుల గ్రేడ్‌తో తక్కువ-ధర ఏరియల్ మ్యాపింగ్. » రిమోట్ సెన్సింగ్‌పై 37 వ ఆసియా సమావేశం. కొలంబో, శ్రీలంక, 2016.

source: Mather, Stephen. OpenDroneMap. 30 de Marzo de 2020. https://community.opendronemap.org/t/the-accuracy-of-webodm-using-rtk-uavs/3937 (accessed 10 12, 2020).
es: Mather, Stephen. OpenDroneMap. 30 de Marzo de 2020. https://community.opendronemap.org/t/the-accuracy-of-webodm-using-rtk-uavs/3937 (último acceso el 12 del 10, 2020).
te: మాథర్, స్టీఫెన్. OpenDroneMap. 30 డి మార్జో డి 2020. https://community.opendronemap.org/t/the-accuracy-of-webodm-using-rtk-uavs/3937 (సేకరణ తేదీ 10 12, 2020).

source: Pascual, Manuel S. GIS Lounge: GIS Data: A Look at Accuracy, Precision, and Types of Errors. 11 6, 2011. https://www.gislounge.com/gis-data-a-look-at-accuracy-precision-and-types-of-errors/ (accessed 07 09, 2020).
es: Pascual, Manuel S. GIS Lounge: GIS Data: A Look at Accuracy, Precision, and Types of Errors. 11 6, 2011. https://www.gislounge.com/gis-data-a-look-at-accuracy-precision-and-types-of-errors/ (último acceso el 09 del 07, 2020).
te: పాస్కల్, మాన్యువల్ ఎస్. జిఐఎస్ లాంజ్: జిఐఎస్ డేటా: ఎ లుక్ ఎట్ ఖచ్చితత్వం, ప్రెసిషన్, మరియు రకాలు లోపాలు. 11 6, 2011. https://www.gislounge.com/gis-data-a-look-at-accuracy-precision-and-types-of-errors/ (యాక్సెస్ 07 09, 2020).

source: Pix4D. «What is accuracy in an aerial mapping project?» Pix4D. 25 de 05 de 2019. https://www.pix4d.com/blog/accuracy-aerial-mapping (accessed 10 13, 2020).
es: Pix4D. «What is accuracy in an aerial mapping project?» Pix4D. 25 de 05 de 2019. https://www.pix4d.com/blog/accuracy-aerial-mapping (último acceso el 13 del 10, 2020).
te: పిక్స్ 4 డి. A ఏరియల్ మ్యాపింగ్ ప్రాజెక్టులో ఖచ్చితత్వం ఏమిటి? » పిక్స్ 4 డి. 25 డి 05 డి 2019. https://www.pix4d.com/blog/accuracy-aerial-mapping (యాక్సెస్డ్ 10 13, 2020).

source: `Learn to edit <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ and help improve `this page <https://github.com/OpenDroneMap/docs/blob/publish/source/map-accuracy.rst>`_!
es: `Aprende a editar <https://github.com/opendronemap/docs#how-to-make-your-first-contribution>`_ y ayuda a mejorar `esta página <https://github.com/OpenDroneMap/docs/blob/publish/source/map-accuracy.rst>`_!
