Repository: OpenDroneMap/docs
Catalog: source/locale/*/LC_MESSAGES/resources.po
Languages: fil, sw

source: Additional References
fil: Karagdagang Sanggunian
sw: Kumbukumbu za ziada

source: For Users
fil: Para sa gagamit
sw: Kwa watumiaji

source: The following resources are a good place to start:
fil: Ang mga sumusunod na impormasyon ay makakatulong sa pagsisimula.
sw: Rasilimali zifuatazo ni sehemu nzuri kuanzia:

source: `README page for ODM <https://github.com/OpenDroneMap/OpenDroneMap>`_
fil: Mga instruksiyon na dapat basahin sa ODM <https://github.com/OpenDroneMap/OpenDroneMap>`_
sw: `Ukurasa wa README kwa ODM <https://github.com/OpenDroneMap/OpenDroneMap>`_

source: `README page for WebODM <https://github.com/OpenDroneMap/WebODM>`_
fil: Mga instruksiyon para sa WebODM <https://github.com/OpenDroneMap/WebODM>`_
sw: `Ukurasa wa README kwa WebODM <https://github.com/OpenDroneMap/WebODM>`_

source: `README page for NodeODM <https://github.com/OpenDroneMap/node-OpenDroneMap>`_
fil: Mga Instruksiyon patungkol sa NodeODM <https://github.com/OpenDroneMap/node-OpenDroneMap>`_
sw: `Ukurasa wa README kwa NodeODM <https://github.com/OpenDroneMap/node-OpenDroneMap>`_

source: `Ground Control Points Format Specification <https://github.com/mapillary/OpenSfM/blob/master/doc/source/gcp.rst>`_
sw: `Uainishaji Muuwa wa Ground Control Points <https://github.com/mapillary/OpenSfM/blob/master/doc/source/gcp.rst>`_

source: `OpenDroneMap: The Missing Guide <https://odmbook.com/>`_
sw: `OpenDroneMap: Maelekezo yaliokosekana <https://odmbook.com/>`_

source: For Developers
fil: Para sa mga taga-buo.
sw: Kwa msanidi programu

source: In addition to user resources, we recommend to also read the following:
fil: Bukod sa mga nailahad na impormasyon, inirerekomenda namin na basahin ang mga sumusunod:
sw: Kwa kuongezea kwa mtumiaji rasilimali, tunapendekeza kusoma zifuatazo:

source: WebODM documentation: https://docs.webodm.org
sw: Nyaraka za WebODM: https://docs.webodm.org

source: Overview of the ODM pipeline: http://community.opendronemap.org/t/where-can-i-find-background-information-on-the-concepts-of-odm/665/2
fil: Kabuuang impormasyon tungkol sa ODM. http://community.opendronemap.org/t/where-can-i-find-background-information-on-the-concepts-of-odm/665/2
sw: Muonekano wa ODM pipeline: http://community.opendronemap.org/t/where-can-i-find-background-information-on-the-concepts-of-odm/665/2

source: We keep a `section in our forum dedicated to research papers <http://community.opendronemap.org/c/ideas-proposals/research-papers>`_. This is a valuable place where to read more about state of the art research related to structure from motion, multi-view stereo, meshing, texturing, etc. which can be used to improve the software.
fil: Pinananatili ang 'section sa porum na dedicated sa research papers <http://community.opendronemap.org/c/ideas-proposals/research-papers>`_. Ito ay importanteng lugar kung saan makakahanap ng state of the art research na related sa structure from motion, multi-view stereo, meshing, texturing, etc., na magagamit para mas mapaganda ang software
sw: Tunaweka `sehemu katika jukwaa maalum kwa karatasi za utafiti <http://community.opendronemap.org/c/ideas-proposals/research-papers>`_. Hii ni sehemu ya thamani ambayo utasoma kuhusu tafiti za sanaa za vitu vinavyoshabihiana na umbile kutoka kwenye mwendo, multi-view sauti, mtandao, mifumo, etc. ambayo inaweza kutumia kuboresha software.
